{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import re\n",
    "from DataCollector import DataCollector\n",
    "DATA_DIR = \"./src/data\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "collector = DataCollector(DATA_DIR)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, URIRef, Literal, Namespace\n",
    "from rdflib.namespace import RDF, XSD"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Criar o modelo (grafo RDF)\n",
    "model = Graph()\n",
    "\n",
    "# Definir namespaces \n",
    "base = Namespace(\"http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#\")\n",
    "xsd  = Namespace(\"http://www.w3.org/2001/XMLSchema#\")\n",
    "foaf = Namespace(\"http://xmlns.com/foaf/0.1/\")\n",
    "rdfs = Namespace(\"http://www.w3.org/2000/01/rdf-schema#\")\n",
    "rdf  = Namespace(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\")\n",
    "dbo  = Namespace(\"http://dbpedia.org/ontology/\")\n",
    "dbp  = Namespace(\"http://dbpedia.org/property/\")\n",
    "dbr  = Namespace(\"http://dbpedia.org/resource/\")\n",
    "\n",
    "# Vincular os namespaces ao grafo \n",
    "model.bind(\"\", base)\n",
    "model.bind(\"xsd\", xsd)\n",
    "model.bind(\"foaf\", foaf)\n",
    "model.bind(\"rdf\", rdf)\n",
    "model.bind(\"rdfs\", rdfs)\n",
    "model.bind(\"dbo\", dbo)\n",
    "model.bind(\"dbp\", dbp)\n",
    "model.bind(\"dbr\", dbr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_countries_to_model():\n",
    "    countries = collector.get_countries()\n",
    "\n",
    "    for country_name in countries:\n",
    "        country_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", country_name)\n",
    "        country = URIRef(base + country_name_formated)\n",
    "        model.add((country, RDF.type, dbo.Country))\n",
    "        model.add((country, foaf.name, Literal(country_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_styles_to_model():\n",
    "    artist_styles = collector.get_artist_styles()\n",
    "    work_styles = collector.get_work_styles()\n",
    "    styles = set(artist_styles + work_styles)\n",
    "\n",
    "    for style_name in styles:\n",
    "        style_name_formated = \"Style_\"+re.sub(r\"[^a-zA-Z0-9]\", \"\", style_name)\n",
    "        style = URIRef(base + style_name_formated)\n",
    "        model.add((style, RDF.type, base.Style))\n",
    "        model.add((style, foaf.name, Literal(style_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_subjects_to_model():\n",
    "    subjects = collector.get_subjects()\n",
    "\n",
    "    for subject_name in subjects:\n",
    "        subject_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", subject_name)\n",
    "        subject = URIRef(base + subject_name_formated)\n",
    "        model.add((subject, RDF.type, base.Subject))\n",
    "        model.add((subject, foaf.name, Literal(subject_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_nationalities_to_model():\n",
    "    nationalities = collector.get_artist_nationalities()\n",
    "\n",
    "    for nationality_name in nationalities:\n",
    "        nationality_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", nationality_name)\n",
    "        nationality = URIRef(base + nationality_name_formated)\n",
    "        model.add((nationality, RDF.type, base.Nationality))\n",
    "        model.add((nationality, foaf.name, Literal(nationality_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_museums_to_model():\n",
    "    data = collector.get_museums()\n",
    "    tam = data.shape[0]\n",
    "    \n",
    "    for i in range (tam):\n",
    "        museum_identifier = data.iloc[i][\"identifier\"]\n",
    "        museum = URIRef(base + museum_identifier)\n",
    "        model.add((museum, RDF.type, dbo.Museum))\n",
    "\n",
    "        museum_name = str(data.iloc[i][\"name\"])\n",
    "        model.add((museum, foaf.name, Literal(museum_name)))\n",
    "\n",
    "        country_name = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"country\"]))\n",
    "        if country_name != \"nan\":\n",
    "            model.add((museum, dbp.country, URIRef(base + country_name )))\n",
    "\n",
    "        state = str(data.iloc[i][\"state\"])\n",
    "        if state != \"nan\":\n",
    "            model.add((museum, base.state, Literal(state)))\n",
    "        \n",
    "        city = str(data.iloc[i][\"city\"])\n",
    "        if city != \"nan\":\n",
    "            model.add((museum, base.city, Literal(city)))\n",
    "        \n",
    "        address = str(data.iloc[i][\"address\"])\n",
    "        if address != \"nan\":\n",
    "            model.add((museum, base.address, Literal(address)))\n",
    "        \n",
    "        postal = str(data.iloc[i][\"postal\"])\n",
    "        if postal != \"nan\":\n",
    "            model.add((museum, base.postal, Literal(postal)))\n",
    "        \n",
    "        phone = str(data.iloc[i][\"phone\"])\n",
    "        if phone != \"nan\":\n",
    "            model.add((museum, base.phone, Literal(phone)))\n",
    "        \n",
    "        url = str(data.iloc[i][\"url\"])\n",
    "        if url != \"nan\":\n",
    "            model.add((museum, foaf.homepage, Literal(url)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_artists_to_model():\n",
    "    data = collector.get_artists()\n",
    "    tam = data.shape[0]\n",
    "    \n",
    "    for i in range (tam):\n",
    "        artist_identifier = data.iloc[i][\"identifier\"]\n",
    "        artist = URIRef(base + artist_identifier)\n",
    "        model.add((artist, RDF.type, dbo.Artist))\n",
    "\n",
    "        full_name = str(data.iloc[i][\"full_name\"])\n",
    "        model.add((artist, foaf.name, Literal(full_name)))\n",
    "\n",
    "        first_name = str(data.iloc[i][\"first_name\"])\n",
    "        if first_name != \"nan\":\n",
    "            model.add((artist, foaf.firstName, Literal(first_name)))\n",
    "\n",
    "        last_name = str(data.iloc[i][\"last_name\"])\n",
    "        if last_name != \"nan\":\n",
    "            model.add((artist, foaf.lastName, Literal(last_name)))\n",
    "        \n",
    "        birth = str(data.iloc[i][\"birth\"])\n",
    "        if birth != \"nan\":\n",
    "            model.add((artist, base.birth, Literal(birth)))\n",
    "\n",
    "        death = str(data.iloc[i][\"death\"])\n",
    "        if death != \"nan\":\n",
    "            model.add((artist, base.death, Literal(death)))\n",
    "        \n",
    "        nationality = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"nationality\"]))\n",
    "        if nationality != \"nan\":\n",
    "            model.add((artist, dbp.nationality, URIRef(base + nationality )))\n",
    "        \n",
    "        style = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"style\"]))\n",
    "        if style != \"nan\":\n",
    "            model.add((artist, dbo.movement, URIRef(base + style )))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_works_to_model():\n",
    "    data = collector.get_works()\n",
    "    tam = data.shape[0]\n",
    "\n",
    "    for i in range (tam):\n",
    "        work_identifier = data.iloc[i][\"identifier\"]\n",
    "        work = URIRef(base + work_identifier)\n",
    "        model.add((work, RDF.type, dbo.Painting))\n",
    "\n",
    "        name = str(data.iloc[i][\"name\"])\n",
    "        model.add((work, foaf.name, Literal(name)))\n",
    "\n",
    "        artist = collector.get_artist_by_id(data.iloc[i][\"artist_id\"])\n",
    "        if artist is not None:\n",
    "            model.add((work, dbp.artist, URIRef(base + artist )))\n",
    "        \n",
    "        style = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"style\"]))\n",
    "        if style != \"nan\":\n",
    "            model.add((work, dbp.style, URIRef(base + style )))\n",
    "        \n",
    "        subject = collector.get_subject_by_id(data.iloc[i][\"work_id\"])\n",
    "        if subject is not None:\n",
    "            model.add((work, dbp.subject, URIRef(base + subject )))\n",
    "\n",
    "        museum_id = data.iloc[i][\"museum_id\"]\n",
    "        if museum_id != \"nan\":\n",
    "            work_museum = collector.get_museum_by_id(museum_id)\n",
    "            if work_museum is not None:\n",
    "                model.add((work, dbp.museum, URIRef(base + work_museum)))\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_nationalities_to_model()\n",
    "add_subjects_to_model()\n",
    "add_countries_to_model()\n",
    "add_styles_to_model()\n",
    "add_works_to_model()\n",
    "add_museums_to_model()\n",
    "add_artists_to_model()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Serializar o grafo para um arquivo ou string\n",
    "output_file = \"output.ttl\"  \n",
    "with open(output_file, \"w\", encoding=\"utf-8\") as fout:\n",
    "    fout.write(model.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "from owlrl import DeductiveClosure, RDFS_Semantics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Modelo inferido:\n"
     ]
    }
   ],
   "source": [
    "schema_file = \"./paintingsontology.ttl\"\n",
    "data_file = \"./output.ttl\"\n",
    "\n",
    "schema = Graph()\n",
    "schema.parse(schema_file)  # Ler o esquema\n",
    "\n",
    "data = Graph()\n",
    "data.parse(data_file, format=\"turtle\")  # Ler os dados \n",
    "\n",
    "inferred_model = Graph()\n",
    "inferred_model += schema\n",
    "inferred_model += data\n",
    "\n",
    "DeductiveClosure(RDFS_Semantics).expand(inferred_model)  # Inferência RDFS\n",
    "\n",
    "print(\"Modelo inferido:\")\n",
    "output_file2 = \"output2.ttl\"  \n",
    "with open(output_file2, \"w\", encoding='utf-8') as fout:\n",
    "    fout.write(inferred_model.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "museums = collector.get_museums()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "museums_name = museums[\"name\"].tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Latitude: 48.85941225, Longitude: 2.2672551197388042\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div style=\"width:100%;\"><div style=\"position:relative;width:100%;height:0;padding-bottom:60%;\"><span style=\"color:#565656\">Make this Notebook Trusted to load map: File -> Trust Notebook</span><iframe srcdoc=\"&lt;!DOCTYPE html&gt;\n",
       "&lt;html&gt;\n",
       "&lt;head&gt;\n",
       "    \n",
       "    &lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=UTF-8&quot; /&gt;\n",
       "    \n",
       "        &lt;script&gt;\n",
       "            L_NO_TOUCH = false;\n",
       "            L_DISABLE_3D = false;\n",
       "        &lt;/script&gt;\n",
       "    \n",
       "    &lt;style&gt;html, body {width: 100%;height: 100%;margin: 0;padding: 0;}&lt;/style&gt;\n",
       "    &lt;style&gt;#map {position:absolute;top:0;bottom:0;right:0;left:0;}&lt;/style&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://code.jquery.com/jquery-3.7.1.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/js/bootstrap.bundle.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap-glyphicons.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/@fortawesome/fontawesome-free@6.2.0/css/all.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/gh/python-visualization/folium/folium/templates/leaflet.awesome.rotate.min.css&quot;/&gt;\n",
       "    \n",
       "            &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width,\n",
       "                initial-scale=1.0, maximum-scale=1.0, user-scalable=no&quot; /&gt;\n",
       "            &lt;style&gt;\n",
       "                #map_996b4261f912132cb24a311c37f7b7f0 {\n",
       "                    position: relative;\n",
       "                    width: 800.0px;\n",
       "                    height: 400.0px;\n",
       "                    left: 0.0%;\n",
       "                    top: 0.0%;\n",
       "                }\n",
       "                .leaflet-container { font-size: 1rem; }\n",
       "            &lt;/style&gt;\n",
       "        \n",
       "&lt;/head&gt;\n",
       "&lt;body&gt;\n",
       "    \n",
       "    \n",
       "            &lt;div class=&quot;folium-map&quot; id=&quot;map_996b4261f912132cb24a311c37f7b7f0&quot; &gt;&lt;/div&gt;\n",
       "        \n",
       "&lt;/body&gt;\n",
       "&lt;script&gt;\n",
       "    \n",
       "    \n",
       "            var map_996b4261f912132cb24a311c37f7b7f0 = L.map(\n",
       "                &quot;map_996b4261f912132cb24a311c37f7b7f0&quot;,\n",
       "                {\n",
       "                    center: [48.85941225, 2.2672551197388042],\n",
       "                    crs: L.CRS.EPSG3857,\n",
       "                    zoom: 50,\n",
       "                    zoomControl: true,\n",
       "                    preferCanvas: false,\n",
       "                }\n",
       "            );\n",
       "\n",
       "            \n",
       "\n",
       "        \n",
       "    \n",
       "            var tile_layer_0b701fe5969e65f3eebec9b78ea98cc9 = L.tileLayer(\n",
       "                &quot;https://tile.openstreetmap.org/{z}/{x}/{y}.png&quot;,\n",
       "                {&quot;attribution&quot;: &quot;\\u0026copy; \\u003ca href=\\&quot;https://www.openstreetmap.org/copyright\\&quot;\\u003eOpenStreetMap\\u003c/a\\u003e contributors&quot;, &quot;detectRetina&quot;: false, &quot;maxNativeZoom&quot;: 19, &quot;maxZoom&quot;: 19, &quot;minZoom&quot;: 0, &quot;noWrap&quot;: false, &quot;opacity&quot;: 1, &quot;subdomains&quot;: &quot;abc&quot;, &quot;tms&quot;: false}\n",
       "            );\n",
       "        \n",
       "    \n",
       "            tile_layer_0b701fe5969e65f3eebec9b78ea98cc9.addTo(map_996b4261f912132cb24a311c37f7b7f0);\n",
       "        \n",
       "    \n",
       "            var marker_0884b6d0ec024885f6207510791ff348 = L.marker(\n",
       "                [48.85941225, 2.2672551197388042],\n",
       "                {}\n",
       "            ).addTo(map_996b4261f912132cb24a311c37f7b7f0);\n",
       "        \n",
       "    \n",
       "        var popup_b17bf10ee22202d6a94f8fbbe13171bd = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_029b08874c44c48cbd72067aa783d9d6 = $(`&lt;div id=&quot;html_029b08874c44c48cbd72067aa783d9d6&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;The postcode brought me here&lt;/div&gt;`)[0];\n",
       "                popup_b17bf10ee22202d6a94f8fbbe13171bd.setContent(html_029b08874c44c48cbd72067aa783d9d6);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_0884b6d0ec024885f6207510791ff348.bindPopup(popup_b17bf10ee22202d6a94f8fbbe13171bd)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "&lt;/script&gt;\n",
       "&lt;/html&gt;\" style=\"position:absolute;width:100%;height:100%;left:0;top:0;border:none !important;\" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe></div></div>"
      ],
      "text/plain": [
       "<folium.folium.Map at 0x7fbd878c4dc0>"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from geopy.geocoders import Nominatim\n",
    "import random\n",
    "\n",
    "def obter_lat_lon_nominatim(endereco):\n",
    "    geolocator = Nominatim(user_agent=\"sua_aplicacao\")\n",
    "    localizacao = geolocator.geocode(endereco)\n",
    "    if localizacao:\n",
    "        return localizacao.latitude, localizacao.longitude\n",
    "    else:\n",
    "        print(\"Endereço não encontrado\")\n",
    "        return None, None\n",
    "\n",
    "# Exemplo de uso\n",
    "elemento_aleatorio = random.choice(museums_name)\n",
    "endereco = random.choice(museums_name)\n",
    "latitude, longitude = obter_lat_lon_nominatim(endereco)\n",
    "print(f\"Latitude: {latitude}, Longitude: {longitude}\")\n",
    "\n",
    "import folium\n",
    "\n",
    "# create tuples representing our location\n",
    "location = float(latitude), float(longitude)\n",
    "\n",
    "# center the map \n",
    "center = (latitude, longitude)\n",
    "\n",
    "# create a Folium map centred at the above location\n",
    "m = folium.Map(location=center, zoom_start=50, width=800, height=400)\n",
    "\n",
    "# add markers at the locations\n",
    "folium.Marker(location, popup=\"The postcode brought me here\").add_to(m)\n",
    "\n",
    "# refer to the map to display it in Jupyter/Colab notebooks\n",
    "m"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adolph Ulrich Wertmuller | 1751 | 1811 | NULL | Swiss\n",
      "Adèle Romany | 1769 | 1846 | NULL | French\n",
      "Adriaan De Lelie | 1755 | 1820 | NULL | Dutch\n",
      "Adélaïde Labille-Guiard | 1749 | 1803 | NULL | French\n",
      "Adriaen Thomasz. Key | 1544 | 1589 | NULL | Dutch\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de artistas por inicio do nome\n",
    "searchQuery = 'Ad'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?artistName ?birth ?death ?style ?nationality\n",
    "        WHERE {{\n",
    "            ?artist\n",
    "                rdf:type dbo:Artist ;\n",
    "                foaf:name ?artistName ;\n",
    "            .\n",
    "            OPTIONAL {{?artist :birth ?birth .}}\n",
    "            OPTIONAL {{?artist :death ?death .}}\n",
    "            OPTIONAL {{?artist dbo:movement/foaf:name ?style .}}\n",
    "            OPTIONAL {{?artist dbp:nationality/foaf:name ?nationality .}}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?artistName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Museum of Fine Arts, Houston | NULL | TX | Houston | 1001 Bissonnet St | 77005 | +1 713 639-7300 | https://www.mfah.org/\n",
      "Museum of Fine Arts | NULL | NULL | Bern | Hodlerstrasse 8 | 3011 | +41 31 328 09 44 | https://www.kunstmuseumbern.ch/en/\n",
      "Musée des Beaux-Arts Nancy | NULL | NULL | Nancy | 3 Pl. Stanislas | 54000 | +33 3 83 85 30 01 | https://useum.org/museum/Museum-of-Fine-Arts-of-Nancy\n",
      "Musée du Louvre | NULL | Paris | 75001 | Rue de Rivoli | NULL | 33 1 40 20 50 50 | https://www.louvre.fr/en\n",
      "Musée des Beaux-Arts Quimper | NULL | Quimper | 29000 | 40 Pl. Saint-Corentin | NULL | 33 2 98 95 45 20 | https://www.mbaq.fr/en/home-3.html\n",
      "Museum Folkwang | NULL | Essen | 45128 | Museumsplatz 1 | NULL | 49 201 8845000 | https://www.museum-folkwang.de/en\n",
      "Museo Thyssen-Bornemisza | NULL | NULL | Madrid | P.º del Prado, 8 | 28014 | + 34 917 91 13 70 | https://www.museothyssen.org/en\n",
      "Museum Legion of Honor | NULL | CA | San Francisco | 100 34th  Avenue | 94121 | +1 415 750-3600 | https://www.famsf.org/\n",
      "Musée Marmottan Monet | NULL | NULL | Paris | 2 Rue Louis Boilly | 75016 | +33 1 44 96 50 33 | https://www.marmottan.fr/en/\n",
      "Musée d'Orsay | NULL | NULL | Paris | 1 Rue de la Légion d'Honneur | 75007 | +33 (0)1 40 49 48 14 | https://www.musee-orsay.fr/en\n",
      "Museé de Grenoble | NULL | Grenoble | 38000 | 5 Pl. de Lavalette | NULL | 33 4 76 63 44 44 | https://www.museedegrenoble.fr/1986-the-museum-in-english.htm\n",
      "Museo del Prado | NULL | NULL | Madrid | C. de Ruiz de Alarcón, 23 | 28014 | +34 913 30 28 00 | https://www.museodelprado.es/en\n",
      "Museum of Fine Arts Boston | NULL | MA | Boston | 465 Huntington Ave | 2115 | 617-267-9300 | https://www.mfa.org/\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de museus por inicio do nome\n",
    "searchQuery = 'Mus'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?museumName ?country ?state ?city ?address ?postal ?phone ?url\n",
    "        WHERE {{\n",
    "            ?museum\n",
    "                rdf:type dbo:Museum ;\n",
    "                foaf:name ?museumName ;\n",
    "            .\n",
    "            OPTIONAL {{?museum dbo:country/foaf:name ?country .}}\n",
    "            OPTIONAL {{?museum :state ?state .}}\n",
    "            OPTIONAL {{?museum :city ?city .}}\n",
    "            OPTIONAL {{?museum :address ?address .}}\n",
    "            OPTIONAL {{?museum :postal ?postal .}}\n",
    "            OPTIONAL {{?museum :phone ?phone .}}\n",
    "            OPTIONAL {{?museum foaf:homepage ?url .}}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?museumName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Grand Canal in Venice with Palazzo Bembo | Francesco Guardi | NULL | NULL | The J. Paul Getty Museum\n",
      "The Grand Canal in Venice | Albert Marquet | NULL | NULL | NULL\n",
      "The Grand Canal Blue Venice | Édouard Manet | NULL | NULL | NULL\n",
      "The Grande Creuse at Pont de Vervy | Claude Monet | NULL | NULL | Philadelphia Museum of Art\n",
      "The Grand Canal in Venice from Palazzo Flangini to Campo San Marcuola | Canaletto | NULL | NULL | The J. Paul Getty Museum\n",
      "The Grand Canal, Venice | Édouard Manet | NULL | NULL | NULL\n",
      "The Grand Canyon of the Colorado | Thomas Moran | NULL | NULL | NULL\n",
      "The Grand Canal from Palazzo Flangini to Campo San Marcuola | Canaletto | NULL | NULL | NULL\n",
      "The Grand Canal with San Simeone Piccolo, Venice | Canaletto | NULL | NULL | National Gallery\n",
      "The Grand Canal Above the Rialto | Francesco Guardi | NULL | NULL | The Metropolitan Museum of Art\n",
      "The Grand Canyon of the Yellowstone | Thomas Moran | NULL | NULL | NULL\n",
      "The Grand Bath at Bursa | Jean-Léon Gérôme | NULL | NULL | NULL\n",
      "The Grand Vizier Crossing the Atmeydani (Horse Square) | Jean Baptiste Vanmour | NULL | NULL | Rijksmuseum\n",
      "The Grand Nude | Amedeo Modigliani | NULL | NULL | The Museum of Modern Art\n",
      "The Grand Canal, Venice | Joseph M. W. Turner | NULL | NULL | The Metropolitan Museum of Art\n",
      "The Grand White Eunuch | Jean-Léon Gérôme | NULL | NULL | NULL\n",
      "The Grands Boulevards | Pierre-Auguste Renoir | NULL | NULL | Philadelphia Museum of Art\n",
      "The Grand Canal with the Church of San Stae, Venice | Canaletto | NULL | NULL | NULL\n",
      "The Grand Canal and Santa Maria della Salute | Claude Monet | NULL | NULL | NULL\n",
      "The Grand Canal | Claude Monet | NULL | NULL | Museum of Fine Arts Boston\n",
      "The Grand Canal from Campo S. Vio towards the Bacino | Canaletto | NULL | NULL | NULL\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de obras por inicio do nome\n",
    "searchQuery = 'The Grand'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?workName ?artist ?style ?subject ?location\n",
    "        WHERE {{\n",
    "            ?work\n",
    "                rdf:type dbo:Painting ;\n",
    "                foaf:name ?workName ;\n",
    "            .\n",
    "            OPTIONAL {{?work dbp:artist/foaf:name ?artist .}}\n",
    "            OPTIONAL {{?work dbp:style/foaf:name ?style .}}\n",
    "            OPTIONAL {{?work dbp:subject/foaf:name ?subject .}}\n",
    "            OPTIONAL {{?work dbp:museum/foaf:name ?location .}}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?workName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "American Landscape\n",
      "American West\n",
      "America West\n",
      "American Art\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de estilos por inicio do nome\n",
    "searchQuery = 'America'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?styleName\n",
    "        WHERE {{\n",
    "            ?style\n",
    "                rdf:type :Style ;\n",
    "                foaf:name ?styleName ;\n",
    "            .\n",
    "            FILTER (STRSTARTS(LCASE(STR(?styleName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Autumn/Fall\n",
      "Abstract/Modern Art\n",
      "Architectures\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de temas por inicio do nome\n",
    "searchQuery = 'A'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?subjectName\n",
    "        WHERE {{\n",
    "            ?subject\n",
    "                rdf:type :Subject ;\n",
    "                foaf:name ?subjectName ;\n",
    "            .\n",
    "            FILTER (STRSTARTS(LCASE(STR(?subjectName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Bottle, Glass, Fork | NULL\n",
      "Stag at Sharkey's | NULL\n",
      "Constellations | NULL\n",
      "The Large Plane Trees | NULL\n",
      "Cleveland Apollo | NULL\n",
      "Fall of Simon Magus | NULL\n",
      "The Crucifixion of Saint Andrew | NULL\n",
      "Un lièvre et un gigot de mouton | NULL\n",
      "La Vie | NULL\n",
      "Source | NULL\n"
     ]
    }
   ],
   "source": [
    "# Listar 10 obras de um museu junto com o estilo daquela obra\n",
    "museumURL = 'http://www.clevelandart.org/'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        SELECT ?title ?style\n",
    "        WHERE {{\n",
    "            SERVICE <https://dbpedia.org/sparql> {{\n",
    "                ?workDbo a dbo:Work ;\n",
    "                         dbp:title ?title ;\n",
    "                         dbo:museum/dbp:website <{museumURL}> .\n",
    "            }}\n",
    "            OPTIONAL {{\n",
    "                ?workLocal\n",
    "                    rdf:type dbo:Painting ;\n",
    "                    foaf:name ?titleLocal ;\n",
    "                    dbp:style/foaf:name ?style ;\n",
    "                .\n",
    "                FILTER (STR(?title) = STR(?titleLocal))\n",
    "            }}\n",
    "        }}\n",
    "        LIMIT 10\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': dbr,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1749 | 1803 | NULL | French | http://commons.wikimedia.org/wiki/Special:FilePath/Adélaïde_Labille-Guiard_-_Self-Portrait_with_Two_Pupils_-_The_Metropolitan_Museum_of_Art.jpg?width=300\n"
     ]
    }
   ],
   "source": [
    "# Retornar os dados e a imagem de um artista pelo nome\n",
    "artistName = 'Adélaïde Labille-Guiard'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?birth ?death ?style ?nationality ?image\n",
    "        WHERE {{\n",
    "            OPTIONAL {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?artistDbo a dbo:Animal ;\n",
    "                        rdfs:label \"{artistName}\"@en ;\n",
    "                        dbo:thumbnail ?image .\n",
    "                }}\n",
    "            }}\n",
    "            ?artist\n",
    "                rdf:type dbo:Artist ;\n",
    "                foaf:name \"{artistName}\" ;\n",
    "            .\n",
    "            OPTIONAL {{?artist :birth ?birth .}}\n",
    "            OPTIONAL {{?artist :death ?death .}}\n",
    "            OPTIONAL {{?artist dbo:movement/foaf:name ?style .}}\n",
    "            OPTIONAL {{?artist dbp:nationality/foaf:name ?nationality .}}\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': dbr,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "        'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "United Kingdom | SE10 9NF | London | Romney Rd | NULL | 44 20 8858 4422 | https://www.rmg.co.uk/national-maritime-museum | 51.481111 -0.005556\n"
     ]
    }
   ],
   "source": [
    "# Retornar os dados e as coordenadas de um museu pelo nome\n",
    "museumName = 'National Maritime Museum'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?country ?state ?city ?address ?postal ?phone ?url ?coords\n",
    "        WHERE {{\n",
    "            OPTIONAL {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?museumDbo a dbo:Building ;\n",
    "                        rdfs:label \"{museumName}\"@en ;\n",
    "                        georss:point ?coords .\n",
    "                }}\n",
    "            }}\n",
    "            ?museum\n",
    "                rdf:type dbo:Museum ;\n",
    "                foaf:name \"{museumName}\" ;\n",
    "            .\n",
    "            OPTIONAL {{?museum dbp:country/foaf:name ?country .}}\n",
    "            OPTIONAL {{?museum :state ?state .}}\n",
    "            OPTIONAL {{?museum :city ?city .}}\n",
    "            OPTIONAL {{?museum :address ?address .}}\n",
    "            OPTIONAL {{?museum :postal ?postal .}}\n",
    "            OPTIONAL {{?museum :phone ?phone .}}\n",
    "            OPTIONAL {{?museum foaf:homepage ?url .}}\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': dbr,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "        'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
    "        'georss': 'http://www.georss.org/georss/',\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
