{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import re\n",
    "from DataCollector import DataCollector\n",
    "DATA_DIR = \"./src/data\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "collector = DataCollector(DATA_DIR)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, URIRef, Literal, Namespace\n",
    "from rdflib.namespace import RDF, XSD"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Criar o modelo (grafo RDF)\n",
    "model = Graph()\n",
    "\n",
    "# Definir namespaces \n",
    "base = Namespace(\"http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#\")\n",
    "xsd  = Namespace(\"http://www.w3.org/2001/XMLSchema#\")\n",
    "foaf = Namespace(\"http://xmlns.com/foaf/0.1/\")\n",
    "rdfs = Namespace(\"http://www.w3.org/2000/01/rdf-schema#\")\n",
    "rdf  = Namespace(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\")\n",
    "dbo  = Namespace(\"http://dbpedia.org/ontology/\")\n",
    "dbp  = Namespace(\"http://dbpedia.org/property/\")\n",
    "dbr  = Namespace(\"http://dbpedia.org/resource/\")\n",
    "\n",
    "# Vincular os namespaces ao grafo \n",
    "model.bind(\"\", base)\n",
    "model.bind(\"xsd\", xsd)\n",
    "model.bind(\"foaf\", foaf)\n",
    "model.bind(\"rdf\", rdf)\n",
    "model.bind(\"rdfs\", rdfs)\n",
    "model.bind(\"dbo\", dbo)\n",
    "model.bind(\"dbp\", dbp)\n",
    "model.bind(\"dbr\", dbr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_countries_to_model():\n",
    "    countries = collector.get_countries()\n",
    "\n",
    "    for country_name in countries:\n",
    "        country_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", country_name)\n",
    "        country = URIRef(base + country_name_formated)\n",
    "        model.add((country, RDF.type, dbo.Country))\n",
    "        model.add((country, foaf.name, Literal(country_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_styles_to_model():\n",
    "    artist_styles = collector.get_artist_styles()\n",
    "    work_styles = collector.get_work_styles()\n",
    "    styles = set(artist_styles + work_styles)\n",
    "\n",
    "    for style_name in styles:\n",
    "        style_name_formated = \"Style_\"+re.sub(r\"[^a-zA-Z0-9]\", \"\", style_name)\n",
    "        style = URIRef(base + style_name_formated)\n",
    "        model.add((style, RDF.type, base.Style))\n",
    "        model.add((style, foaf.name, Literal(style_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_subjects_to_model():\n",
    "    subjects = collector.get_subjects()\n",
    "\n",
    "    for subject_name in subjects:\n",
    "        subject_name_formated = 'Subject_'+re.sub(r\"[^a-zA-Z0-9]\", \"\", subject_name)\n",
    "        subject = URIRef(base + subject_name_formated)\n",
    "        model.add((subject, RDF.type, base.Subject))\n",
    "        model.add((subject, foaf.name, Literal(subject_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_nationalities_to_model():\n",
    "    nationalities = collector.get_artist_nationalities()\n",
    "\n",
    "    for nationality_name in nationalities:\n",
    "        nationality_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", nationality_name)\n",
    "        nationality = URIRef(base + nationality_name_formated)\n",
    "        model.add((nationality, RDF.type, base.Nationality))\n",
    "        model.add((nationality, foaf.name, Literal(nationality_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_museums_to_model():\n",
    "    data = collector.get_museums()\n",
    "    tam = data.shape[0]\n",
    "    \n",
    "    for i in range (tam):\n",
    "        museum_identifier = data.iloc[i][\"identifier\"]\n",
    "        museum = URIRef(base + museum_identifier)\n",
    "        model.add((museum, RDF.type, dbo.Museum))\n",
    "\n",
    "        museum_name = str(data.iloc[i][\"name\"])\n",
    "        model.add((museum, foaf.name, Literal(museum_name)))\n",
    "\n",
    "        country_name = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"country\"]))\n",
    "        if country_name != \"nan\":\n",
    "            model.add((museum, dbp.country, URIRef(base + country_name )))\n",
    "\n",
    "        state = str(data.iloc[i][\"state\"])\n",
    "        if state != \"nan\":\n",
    "            model.add((museum, base.state, Literal(state)))\n",
    "        \n",
    "        city = str(data.iloc[i][\"city\"])\n",
    "        if city != \"nan\":\n",
    "            model.add((museum, base.city, Literal(city)))\n",
    "        \n",
    "        address = str(data.iloc[i][\"address\"])\n",
    "        if address != \"nan\":\n",
    "            model.add((museum, base.address, Literal(address)))\n",
    "        \n",
    "        postal = str(data.iloc[i][\"postal\"])\n",
    "        if postal != \"nan\":\n",
    "            model.add((museum, base.postal, Literal(postal)))\n",
    "        \n",
    "        phone = str(data.iloc[i][\"phone\"])\n",
    "        if phone != \"nan\":\n",
    "            model.add((museum, base.phone, Literal(phone)))\n",
    "        \n",
    "        url = str(data.iloc[i][\"url\"])\n",
    "        if url != \"nan\":\n",
    "            model.add((museum, foaf.homepage, Literal(url)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_artists_to_model():\n",
    "    data = collector.get_artists()\n",
    "    tam = data.shape[0]\n",
    "    \n",
    "    for i in range (tam):\n",
    "        artist_identifier = data.iloc[i][\"identifier\"]\n",
    "        artist = URIRef(base + artist_identifier)\n",
    "        model.add((artist, RDF.type, dbo.Artist))\n",
    "\n",
    "        full_name = str(data.iloc[i][\"full_name\"])\n",
    "        model.add((artist, foaf.name, Literal(full_name)))\n",
    "\n",
    "        first_name = str(data.iloc[i][\"first_name\"])\n",
    "        if first_name != \"nan\":\n",
    "            model.add((artist, foaf.firstName, Literal(first_name)))\n",
    "\n",
    "        last_name = str(data.iloc[i][\"last_name\"])\n",
    "        if last_name != \"nan\":\n",
    "            model.add((artist, foaf.lastName, Literal(last_name)))\n",
    "        \n",
    "        birth = str(data.iloc[i][\"birth\"])\n",
    "        if birth != \"nan\":\n",
    "            model.add((artist, base.birth, Literal(birth)))\n",
    "\n",
    "        death = str(data.iloc[i][\"death\"])\n",
    "        if death != \"nan\":\n",
    "            model.add((artist, base.death, Literal(death)))\n",
    "        \n",
    "        nationality = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"nationality\"]))\n",
    "        if nationality != \"nan\":\n",
    "            model.add((artist, dbp.nationality, URIRef(base + nationality )))\n",
    "        \n",
    "        style = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"style\"]))\n",
    "        if style != \"nan\":\n",
    "            model.add((artist, dbo.movement, URIRef(base + \"Style_\" + style )))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_works_to_model():\n",
    "    data = collector.get_works()\n",
    "    tam = data.shape[0]\n",
    "\n",
    "    for i in range (tam):\n",
    "        work_identifier = data.iloc[i][\"identifier\"]\n",
    "        work = URIRef(base + work_identifier)\n",
    "        model.add((work, RDF.type, dbo.Painting))\n",
    "\n",
    "        name = str(data.iloc[i][\"name\"])\n",
    "        model.add((work, foaf.name, Literal(name)))\n",
    "\n",
    "        artist = collector.get_artist_by_id(data.iloc[i][\"artist_id\"])\n",
    "        if artist is not None:\n",
    "            model.add((work, dbp.artist, URIRef(base + artist )))\n",
    "        \n",
    "        style = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"style\"]))\n",
    "        if style != \"nan\":\n",
    "            model.add((work, dbp.style, URIRef(base + \"Style_\" + style )))\n",
    "        \n",
    "        subject = collector.get_subject_by_id(data.iloc[i][\"work_id\"])\n",
    "        if subject is not None:\n",
    "            model.add((work, dbp.subject, URIRef(base + subject )))\n",
    "\n",
    "        museum_id = data.iloc[i][\"museum_id\"]\n",
    "        if museum_id != \"nan\":\n",
    "            work_museum = collector.get_museum_by_id(museum_id)\n",
    "            if work_museum is not None:\n",
    "                model.add((work, dbp.museum, URIRef(base + work_museum)))\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_nationalities_to_model()\n",
    "add_subjects_to_model()\n",
    "add_countries_to_model()\n",
    "add_styles_to_model()\n",
    "add_works_to_model()\n",
    "add_museums_to_model()\n",
    "add_artists_to_model()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Serializar o grafo para um arquivo ou string\n",
    "output_file = \"output.ttl\"  \n",
    "with open(output_file, \"w\", encoding=\"utf-8\") as fout:\n",
    "    fout.write(model.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "from owlrl import DeductiveClosure, RDFS_Semantics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Modelo inferido:\n"
     ]
    }
   ],
   "source": [
    "schema_file = \"./paintingsontology.ttl\"\n",
    "data_file = \"./output.ttl\"\n",
    "\n",
    "schema = Graph()\n",
    "schema.parse(schema_file)  # Ler o esquema\n",
    "\n",
    "data = Graph()\n",
    "data.parse(data_file, format=\"turtle\")  # Ler os dados \n",
    "\n",
    "inferred_model = Graph()\n",
    "inferred_model += schema\n",
    "inferred_model += data\n",
    "\n",
    "DeductiveClosure(RDFS_Semantics).expand(inferred_model)  # Inferência RDFS\n",
    "\n",
    "print(\"Modelo inferido:\")\n",
    "output_file2 = \"output2.ttl\"  \n",
    "with open(output_file2, \"w\", encoding='utf-8') as fout:\n",
    "    fout.write(inferred_model.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "museums = collector.get_museums()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "museums_name = museums[\"name\"].tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Latitude: 51.48077585, Longitude: -0.005122450776572108\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div style=\"width:100%;\"><div style=\"position:relative;width:100%;height:0;padding-bottom:60%;\"><span style=\"color:#565656\">Make this Notebook Trusted to load map: File -> Trust Notebook</span><iframe srcdoc=\"&lt;!DOCTYPE html&gt;\n",
       "&lt;html&gt;\n",
       "&lt;head&gt;\n",
       "    \n",
       "    &lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=UTF-8&quot; /&gt;\n",
       "    \n",
       "        &lt;script&gt;\n",
       "            L_NO_TOUCH = false;\n",
       "            L_DISABLE_3D = false;\n",
       "        &lt;/script&gt;\n",
       "    \n",
       "    &lt;style&gt;html, body {width: 100%;height: 100%;margin: 0;padding: 0;}&lt;/style&gt;\n",
       "    &lt;style&gt;#map {position:absolute;top:0;bottom:0;right:0;left:0;}&lt;/style&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://code.jquery.com/jquery-3.7.1.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/js/bootstrap.bundle.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap-glyphicons.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/@fortawesome/fontawesome-free@6.2.0/css/all.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/gh/python-visualization/folium/folium/templates/leaflet.awesome.rotate.min.css&quot;/&gt;\n",
       "    \n",
       "            &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width,\n",
       "                initial-scale=1.0, maximum-scale=1.0, user-scalable=no&quot; /&gt;\n",
       "            &lt;style&gt;\n",
       "                #map_3c8bfff4c64319a3437f035bfa350682 {\n",
       "                    position: relative;\n",
       "                    width: 800.0px;\n",
       "                    height: 400.0px;\n",
       "                    left: 0.0%;\n",
       "                    top: 0.0%;\n",
       "                }\n",
       "                .leaflet-container { font-size: 1rem; }\n",
       "            &lt;/style&gt;\n",
       "        \n",
       "&lt;/head&gt;\n",
       "&lt;body&gt;\n",
       "    \n",
       "    \n",
       "            &lt;div class=&quot;folium-map&quot; id=&quot;map_3c8bfff4c64319a3437f035bfa350682&quot; &gt;&lt;/div&gt;\n",
       "        \n",
       "&lt;/body&gt;\n",
       "&lt;script&gt;\n",
       "    \n",
       "    \n",
       "            var map_3c8bfff4c64319a3437f035bfa350682 = L.map(\n",
       "                &quot;map_3c8bfff4c64319a3437f035bfa350682&quot;,\n",
       "                {\n",
       "                    center: [51.48077585, -0.005122450776572108],\n",
       "                    crs: L.CRS.EPSG3857,\n",
       "                    zoom: 50,\n",
       "                    zoomControl: true,\n",
       "                    preferCanvas: false,\n",
       "                }\n",
       "            );\n",
       "\n",
       "            \n",
       "\n",
       "        \n",
       "    \n",
       "            var tile_layer_6aa975bc5a2924e8bf15e8d1cb7c7ffd = L.tileLayer(\n",
       "                &quot;https://tile.openstreetmap.org/{z}/{x}/{y}.png&quot;,\n",
       "                {&quot;attribution&quot;: &quot;\\u0026copy; \\u003ca href=\\&quot;https://www.openstreetmap.org/copyright\\&quot;\\u003eOpenStreetMap\\u003c/a\\u003e contributors&quot;, &quot;detectRetina&quot;: false, &quot;maxNativeZoom&quot;: 19, &quot;maxZoom&quot;: 19, &quot;minZoom&quot;: 0, &quot;noWrap&quot;: false, &quot;opacity&quot;: 1, &quot;subdomains&quot;: &quot;abc&quot;, &quot;tms&quot;: false}\n",
       "            );\n",
       "        \n",
       "    \n",
       "            tile_layer_6aa975bc5a2924e8bf15e8d1cb7c7ffd.addTo(map_3c8bfff4c64319a3437f035bfa350682);\n",
       "        \n",
       "    \n",
       "            var marker_8648e149400ec5555fc85b8075ac57dc = L.marker(\n",
       "                [51.48077585, -0.005122450776572108],\n",
       "                {}\n",
       "            ).addTo(map_3c8bfff4c64319a3437f035bfa350682);\n",
       "        \n",
       "    \n",
       "        var popup_1bd00a527fbc002733fa81c88dbd4b7a = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_ff4ac001dfee4f517a05fa55e4e646e8 = $(`&lt;div id=&quot;html_ff4ac001dfee4f517a05fa55e4e646e8&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;The postcode brought me here&lt;/div&gt;`)[0];\n",
       "                popup_1bd00a527fbc002733fa81c88dbd4b7a.setContent(html_ff4ac001dfee4f517a05fa55e4e646e8);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_8648e149400ec5555fc85b8075ac57dc.bindPopup(popup_1bd00a527fbc002733fa81c88dbd4b7a)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "&lt;/script&gt;\n",
       "&lt;/html&gt;\" style=\"position:absolute;width:100%;height:100%;left:0;top:0;border:none !important;\" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe></div></div>"
      ],
      "text/plain": [
       "<folium.folium.Map at 0x1beacb84890>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from geopy.geocoders import Nominatim\n",
    "import random\n",
    "\n",
    "def obter_lat_lon_nominatim(endereco):\n",
    "    geolocator = Nominatim(user_agent=\"sua_aplicacao\")\n",
    "    localizacao = geolocator.geocode(endereco)\n",
    "    if localizacao:\n",
    "        return localizacao.latitude, localizacao.longitude\n",
    "    else:\n",
    "        print(\"Endereço não encontrado\")\n",
    "        return None, None\n",
    "\n",
    "# Exemplo de uso\n",
    "elemento_aleatorio = random.choice(museums_name)\n",
    "endereco = random.choice(museums_name)\n",
    "latitude, longitude = obter_lat_lon_nominatim(endereco)\n",
    "print(f\"Latitude: {latitude}, Longitude: {longitude}\")\n",
    "\n",
    "import folium\n",
    "\n",
    "# create tuples representing our location\n",
    "location = float(latitude), float(longitude)\n",
    "\n",
    "# center the map \n",
    "center = (latitude, longitude)\n",
    "\n",
    "# create a Folium map centred at the above location\n",
    "m = folium.Map(location=center, zoom_start=50, width=800, height=400)\n",
    "\n",
    "# add markers at the locations\n",
    "folium.Marker(location, popup=\"The postcode brought me here\").add_to(m)\n",
    "\n",
    "# refer to the map to display it in Jupyter/Colab notebooks\n",
    "m"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adolph Ulrich Wertmuller | 1751 | 1811 | Portraitist | Swiss\n",
      "Adèle Romany | 1769 | 1846 | Portraitist | French\n",
      "Adélaïde Labille-Guiard | 1749 | 1803 | Neoclassical | French\n",
      "Adriaen Thomasz. Key | 1544 | 1589 | Renaissance | Dutch\n",
      "Adriaan De Lelie | 1755 | 1820 | Portraitist | Dutch\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de artistas por inicio do nome\n",
    "searchQuery = 'Ad'.lower()\n",
    "qres = inferred_model.query(\n",
    "    \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?artistName ?birth ?death ?style ?nationality\n",
    "        WHERE {\n",
    "            ?artist\n",
    "                rdf:type dbo:Artist ;\n",
    "                foaf:name ?artistName ;\n",
    "            .\n",
    "            OPTIONAL {?artist :birth ?birth .}\n",
    "            OPTIONAL {?artist :death ?death .}\n",
    "            OPTIONAL {?artist dbo:movement/foaf:name ?style .}\n",
    "            OPTIONAL {?artist dbp:nationality/foaf:name ?nationality .}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?artistName)), ?searchQuery))\n",
    "        }\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    },\n",
    "    initBindings={'searchQuery': Literal(searchQuery)},\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Museum Folkwang | Germany | Essen | 45128 | Museumsplatz 1 | NULL | 49 201 8845000 | https://www.museum-folkwang.de/en\n",
      "Musée des Beaux-Arts Quimper | France | Quimper | 29000 | 40 Pl. Saint-Corentin | NULL | 33 2 98 95 45 20 | https://www.mbaq.fr/en/home-3.html\n",
      "Museum of Fine Arts | Switzerland | NULL | Bern | Hodlerstrasse 8 | 3011 | +41 31 328 09 44 | https://www.kunstmuseumbern.ch/en/\n",
      "Musée du Louvre | France | Paris | 75001 | Rue de Rivoli | NULL | 33 1 40 20 50 50 | https://www.louvre.fr/en\n",
      "Musée Marmottan Monet | France | NULL | Paris | 2 Rue Louis Boilly | 75016 | +33 1 44 96 50 33 | https://www.marmottan.fr/en/\n",
      "Musée d'Orsay | France | NULL | Paris | 1 Rue de la Légion d'Honneur | 75007 | +33 (0)1 40 49 48 14 | https://www.musee-orsay.fr/en\n",
      "Museo del Prado | Spain | NULL | Madrid | C. de Ruiz de Alarcón, 23 | 28014 | +34 913 30 28 00 | https://www.museodelprado.es/en\n",
      "Museum of Fine Arts, Houston | USA | TX | Houston | 1001 Bissonnet St | 77005 | +1 713 639-7300 | https://www.mfah.org/\n",
      "Museo Thyssen-Bornemisza | Spain | NULL | Madrid | P.º del Prado, 8 | 28014 | + 34 917 91 13 70 | https://www.museothyssen.org/en\n",
      "Museum Legion of Honor | USA | CA | San Francisco | 100 34th  Avenue | 94121 | +1 415 750-3600 | https://www.famsf.org/\n",
      "Musée des Beaux-Arts Nancy | France | NULL | Nancy | 3 Pl. Stanislas | 54000 | +33 3 83 85 30 01 | https://useum.org/museum/Museum-of-Fine-Arts-of-Nancy\n",
      "Museum of Fine Arts Boston | USA | MA | Boston | 465 Huntington Ave | 2115 | 617-267-9300 | https://www.mfa.org/\n",
      "Museé de Grenoble | France | Grenoble | 38000 | 5 Pl. de Lavalette | NULL | 33 4 76 63 44 44 | https://www.museedegrenoble.fr/1986-the-museum-in-english.htm\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de museus por inicio do nome\n",
    "searchQuery = 'Mus'.lower()\n",
    "qres = inferred_model.query(\n",
    "    \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?museumName ?country ?state ?city ?address ?postal ?phone ?url\n",
    "        WHERE {\n",
    "            ?museum\n",
    "                rdf:type dbo:Museum ;\n",
    "                foaf:name ?museumName ;\n",
    "            .\n",
    "            OPTIONAL {?museum dbp:country/foaf:name ?country .}\n",
    "            OPTIONAL {?museum :state ?state .}\n",
    "            OPTIONAL {?museum :city ?city .}\n",
    "            OPTIONAL {?museum :address ?address .}\n",
    "            OPTIONAL {?museum :postal ?postal .}\n",
    "            OPTIONAL {?museum :phone ?phone .}\n",
    "            OPTIONAL {?museum foaf:homepage ?url .}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?museumName)), ?searchQuery))\n",
    "        }\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    },\n",
    "    initBindings={'searchQuery': Literal(searchQuery)},\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Grand Canal in Venice | Albert Marquet | Post-Impressionism | Rivers/Lakes | NULL\n",
      "The Grand Canal Above the Rialto | Francesco Guardi | Rococo | Architectures | The Metropolitan Museum of Art\n",
      "The Grand Canal | Claude Monet | Impressionism | Rivers/Lakes | Museum of Fine Arts Boston\n",
      "The Grand Bath at Bursa | Jean-Léon Gérôme | Orientalism | Nude | NULL\n",
      "The Grand Canal in Venice from Palazzo Flangini to Campo San Marcuola | Canaletto | Rococo | Architectures | The J. Paul Getty Museum\n",
      "The Grand Canal, Venice | Joseph M. W. Turner | Neo-Classicism | Rivers/Lakes | The Metropolitan Museum of Art\n",
      "The Grand Canyon of the Colorado | Thomas Moran | American Landscape | Landscape Art | NULL\n",
      "The Grand White Eunuch | Jean-Léon Gérôme | Orientalism | NULL | NULL\n",
      "The Grand Canal from Palazzo Flangini to Campo San Marcuola | Canaletto | Rococo | Architectures | NULL\n",
      "The Grande Creuse at Pont de Vervy | Claude Monet | Impressionism | NULL | Philadelphia Museum of Art\n",
      "The Grands Boulevards | Pierre-Auguste Renoir | Impressionism | NULL | Philadelphia Museum of Art\n",
      "The Grand Canal, Venice | Édouard Manet | Impressionism | Rivers/Lakes | NULL\n",
      "The Grand Vizier Crossing the Atmeydani (Horse Square) | Jean Baptiste Vanmour | Orientalism | NULL | Rijksmuseum\n",
      "The Grand Canal with San Simeone Piccolo, Venice | Canaletto | Rococo | Architectures | National Gallery\n",
      "The Grand Canal Blue Venice | Édouard Manet | Impressionism | Rivers/Lakes | NULL\n",
      "The Grand Nude | Amedeo Modigliani | Expressionism | Nude | The Museum of Modern Art\n",
      "The Grand Canal in Venice with Palazzo Bembo | Francesco Guardi | Rococo | Architectures | The J. Paul Getty Museum\n",
      "The Grand Canyon of the Yellowstone | Thomas Moran | American Landscape | Landscape Art | NULL\n",
      "The Grand Canal from Campo S. Vio towards the Bacino | Canaletto | Rococo | Architectures | NULL\n",
      "The Grand Canal with the Church of San Stae, Venice | Canaletto | Rococo | Architectures | NULL\n",
      "The Grand Canal and Santa Maria della Salute | Claude Monet | Impressionism | Rivers/Lakes | NULL\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de obras por inicio do nome\n",
    "searchQuery = 'The Grand'.lower()\n",
    "qres = inferred_model.query(\n",
    "    \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?workName ?artist ?style ?subject ?location\n",
    "        WHERE {\n",
    "            ?work\n",
    "                rdf:type dbo:Painting ;\n",
    "                foaf:name ?workName ;\n",
    "            .\n",
    "            OPTIONAL {?work dbp:artist/foaf:name ?artist .}\n",
    "            OPTIONAL {?work dbp:style/foaf:name ?style .}\n",
    "            OPTIONAL {?work dbp:subject/foaf:name ?subject .}\n",
    "            OPTIONAL {?work dbp:museum/foaf:name ?location .}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?workName)), ?searchQuery))\n",
    "        }\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    },\n",
    "    initBindings={'searchQuery': Literal(searchQuery)},\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "American West\n",
      "American Art\n",
      "America West\n",
      "American Landscape\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de estilos por inicio do nome\n",
    "searchQuery = 'America'.lower()\n",
    "qres = inferred_model.query(\n",
    "    \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?styleName\n",
    "        WHERE {\n",
    "            ?style\n",
    "                rdf:type :Style ;\n",
    "                foaf:name ?styleName ;\n",
    "            .\n",
    "            FILTER (STRSTARTS(LCASE(STR(?styleName)), ?searchQuery))\n",
    "        }\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    },\n",
    "    initBindings={'searchQuery': Literal(searchQuery)},\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Abstract/Modern Art\n",
      "Architectures\n",
      "Autumn/Fall\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de temas por inicio do nome\n",
    "searchQuery = 'A'.lower()\n",
    "qres = inferred_model.query(\n",
    "    \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?subjectName\n",
    "        WHERE {\n",
    "            ?subject\n",
    "                rdf:type :Subject ;\n",
    "                foaf:name ?subjectName ;\n",
    "            .\n",
    "            FILTER (STRSTARTS(LCASE(STR(?subjectName)), ?searchQuery))\n",
    "        }\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    },\n",
    "    initBindings={'searchQuery': Literal(searchQuery)},\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Bottle, Glass, Fork | NULL\n",
      "Stag at Sharkey's | NULL\n",
      "Constellations | NULL\n",
      "The Large Plane Trees | NULL\n",
      "Cleveland Apollo | NULL\n",
      "Fall of Simon Magus | NULL\n",
      "The Crucifixion of Saint Andrew | Baroque\n",
      "Un lièvre et un gigot de mouton | NULL\n",
      "La Vie | NULL\n",
      "Source | NULL\n"
     ]
    }
   ],
   "source": [
    "# Listar 10 obras de um museu junto com o estilo daquela obra\n",
    "museumURL = 'http://www.clevelandart.org/'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        SELECT ?title ?style\n",
    "        WHERE {{\n",
    "            SERVICE <https://dbpedia.org/sparql> {{\n",
    "                ?workDbo a dbo:Work ;\n",
    "                         dbp:title ?title ;\n",
    "                         dbo:museum/dbp:website <{museumURL}> .\n",
    "            }}\n",
    "            OPTIONAL {{\n",
    "                ?workLocal\n",
    "                    rdf:type dbo:Painting ;\n",
    "                    foaf:name ?titleLocal ;\n",
    "                    dbp:style/foaf:name ?style ;\n",
    "                .\n",
    "                FILTER (STR(?title) = STR(?titleLocal))\n",
    "            }}\n",
    "        }}\n",
    "        LIMIT 10\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': dbr,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1749 | 1803 | Neoclassical | French | http://commons.wikimedia.org/wiki/Special:FilePath/Adélaïde_Labille-Guiard_-_Self-Portrait_with_Two_Pupils_-_The_Metropolitan_Museum_of_Art.jpg?width=300\n"
     ]
    }
   ],
   "source": [
    "# Retornar os dados e a imagem de um artista pelo nome\n",
    "artistName = 'Adélaïde Labille-Guiard'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?birth ?death ?style ?nationality ?image\n",
    "        WHERE {{\n",
    "            OPTIONAL {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?artistDbo a dbo:Animal ;\n",
    "                        rdfs:label \"{artistName}\"@en ;\n",
    "                        dbo:thumbnail ?image .\n",
    "                }}\n",
    "            }}\n",
    "            ?artist\n",
    "                rdf:type dbo:Artist ;\n",
    "                foaf:name \"{artistName}\" ;\n",
    "            .\n",
    "            OPTIONAL {{?artist :birth ?birth .}}\n",
    "            OPTIONAL {{?artist :death ?death .}}\n",
    "            OPTIONAL {{?artist dbo:movement/foaf:name ?style .}}\n",
    "            OPTIONAL {{?artist dbp:nationality/foaf:name ?nationality .}}\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': dbr,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "        'rdfs': rdfs,\n",
    "    },\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "United Kingdom | SE10 9NF | London | Romney Rd | NULL | 44 20 8858 4422 | https://www.rmg.co.uk/national-maritime-museum | 51.481111 -0.005556\n"
     ]
    }
   ],
   "source": [
    "# Retornar os dados e as coordenadas de um museu pelo nome\n",
    "museumName = 'National Maritime Museum'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?country ?state ?city ?address ?postal ?phone ?url ?coords\n",
    "        WHERE {{\n",
    "            OPTIONAL {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?museumDbo a dbo:Building ;\n",
    "                        rdfs:label \"{museumName}\"@en ;\n",
    "                        georss:point ?coords .\n",
    "                }}\n",
    "            }}\n",
    "            ?museum\n",
    "                rdf:type dbo:Museum ;\n",
    "                foaf:name \"{museumName}\" ;\n",
    "            .\n",
    "            OPTIONAL {{?museum dbp:country/foaf:name ?country .}}\n",
    "            OPTIONAL {{?museum :state ?state .}}\n",
    "            OPTIONAL {{?museum :city ?city .}}\n",
    "            OPTIONAL {{?museum :address ?address .}}\n",
    "            OPTIONAL {{?museum :postal ?postal .}}\n",
    "            OPTIONAL {{?museum :phone ?phone .}}\n",
    "            OPTIONAL {{?museum foaf:homepage ?url .}}\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': dbr,\n",
    "        'dbo': dbo,\n",
    "        'dbp': dbp,\n",
    "        'rdfs': rdfs,\n",
    "        'georss': 'http://www.georss.org/georss/',\n",
    "    },\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# INTERFACE!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: tkintermapview in c:\\users\\henrique\\anaconda3\\lib\\site-packages (1.29)\n",
      "Requirement already satisfied: geocoder in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (1.38.1)\n",
      "Requirement already satisfied: pillow in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (10.2.0)\n",
      "Requirement already satisfied: requests in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (2.32.3)\n",
      "Requirement already satisfied: pyperclip in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (1.9.0)\n",
      "Requirement already satisfied: customtkinter in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (5.2.2)\n",
      "Requirement already satisfied: pywin32 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (305.1)\n",
      "Requirement already satisfied: darkdetect in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from customtkinter->tkintermapview) (0.8.0)\n",
      "Requirement already satisfied: packaging in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from customtkinter->tkintermapview) (23.1)\n",
      "Requirement already satisfied: click in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (8.1.7)\n",
      "Requirement already satisfied: future in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (0.18.3)\n",
      "Requirement already satisfied: ratelim in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (0.1.6)\n",
      "Requirement already satisfied: six in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (1.16.0)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (2.0.4)\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (2.0.7)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (2024.8.30)\n",
      "Requirement already satisfied: colorama in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from click->geocoder->tkintermapview) (0.4.6)\n",
      "Requirement already satisfied: decorator in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from ratelim->geocoder->tkintermapview) (5.1.1)\n",
      "Requirement already satisfied: Pillow in c:\\users\\henrique\\anaconda3\\lib\\site-packages (10.2.0)\n"
     ]
    }
   ],
   "source": [
    "!pip install tkintermapview\n",
    "!pip install Pillow"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tkinter import *\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import webbrowser\n",
    "import tkintermapview\n",
    "from PIL import ImageTk, Image\n",
    "import requests\n",
    "from io import BytesIO"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "def fetch_data_from_query(search_query, att_names):\n",
    "    \n",
    "    qres = inferred_model.query(\n",
    "        search_query,\n",
    "        initNs={\n",
    "            'rdf': rdf,\n",
    "            'foaf': foaf,\n",
    "            'dbr': dbr,\n",
    "            'dbo': dbo,\n",
    "            'dbp': dbp,\n",
    "            'rdfs': rdfs,\n",
    "            'georss': 'http://www.georss.org/georss/'\n",
    "        },\n",
    "    )\n",
    "\n",
    "\n",
    "    data = []\n",
    "    for row in qres:\n",
    "        obj = {}\n",
    "        for idx, att_name in enumerate(att_names):\n",
    "            value = row[idx]\n",
    "            obj[att_name] = None if value is None else str(value)\n",
    "        data.append(obj)\n",
    "\n",
    "    return data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "def show_museum_details(museum_name):\n",
    "    museum_window = Toplevel()  # Create a new top-level window\n",
    "    museum_window.title(f\"{museum_name}\")\n",
    "\n",
    "    # Create a Canvas widget for scrolling\n",
    "    canvas = Canvas(museum_window)\n",
    "    canvas.pack(side=LEFT, fill=BOTH, expand=True)\n",
    "\n",
    "    # Create a vertical scrollbar linked to the canvas\n",
    "    scrollbar = Scrollbar(museum_window, orient=\"vertical\", command=canvas.yview)\n",
    "    scrollbar.pack(side=RIGHT, fill=\"y\")\n",
    "\n",
    "    # Configure the canvas to use the scrollbar\n",
    "    canvas.configure(yscrollcommand=scrollbar.set)\n",
    "\n",
    "    # Create a frame inside the canvas to hold all the content\n",
    "    content_frame = Frame(canvas)\n",
    "    canvas.create_window((0, 0), window=content_frame, anchor=\"nw\")\n",
    "\n",
    "    query = f\"\"\"\n",
    "            PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "\n",
    "            SELECT ?abstract ?country ?state ?city ?address ?postal ?phone ?url ?coords ?thumbnail ?museum\n",
    "            WHERE {{\n",
    "                OPTIONAL {{\n",
    "                    SERVICE <https://dbpedia.org/sparql> {{\n",
    "                        ?museumDbo a dbo:Building ;\n",
    "                            rdfs:label \"{museum_name}\"@en ;\n",
    "                            georss:point ?coords ;\n",
    "                            dbo:thumbnail ?thumbnail ;\n",
    "                            dbo:abstract ?abstract .\n",
    "                    }}\n",
    "                }}\n",
    "                ?museum\n",
    "                    rdf:type dbo:Museum ;\n",
    "                    foaf:name \"{museum_name}\" ;\n",
    "                .\n",
    "                OPTIONAL {{?museum dbp:country/foaf:name ?country .}}\n",
    "                OPTIONAL {{?museum :state ?state .}}\n",
    "                OPTIONAL {{?museum :city ?city .}}\n",
    "                OPTIONAL {{?museum :address ?address .}}\n",
    "                OPTIONAL {{?museum :postal ?postal .}}\n",
    "                OPTIONAL {{?museum :phone ?phone .}}\n",
    "                OPTIONAL {{?museum foaf:homepage ?url .}}\n",
    "            }}\n",
    "            LIMIT 1\n",
    "        \"\"\"\n",
    "    \n",
    "    att_names = ['abstract', 'country', 'state', 'city', 'address', 'postal', 'phone', 'url', 'coord', 'thumbnail', 'uri']\n",
    "    museum_info = fetch_data_from_query(query, att_names)\n",
    "    museum_info = museum_info[0]\n",
    "    \n",
    "    # Title\n",
    "    title_label = Label(content_frame, text=museum_name, font=(\"Arial\", 12))\n",
    "    title_label.pack(pady=10)\n",
    "\n",
    "    # Image\n",
    "    if museum_info['thumbnail']:\n",
    "        response = requests.get(museum_info['thumbnail'])\n",
    "        if response.status_code == 200:\n",
    "            thumbnail = Image.open(BytesIO(response.content))\n",
    "            test = ImageTk.PhotoImage(thumbnail)\n",
    "            label1 = Label(content_frame, image=test)\n",
    "            label1.image = test\n",
    "            label1.pack(pady=10)\n",
    "    \n",
    "    #Abstract\n",
    "    #if museum_info['abstract']:\n",
    "        #contact_label = Label(content_frame, text=museum_info['abstract'], font=(\"Arial\", 10))\n",
    "        #contact_label.pack(pady=10)\n",
    "    \n",
    "    # Contact\n",
    "    contact_title_label = Label(content_frame, text=f\"Contact:\", font=(\"Arial\", 12))\n",
    "    contact_title_label.pack(pady=10)\n",
    "    address = (museum_info['address'] if museum_info['address'] else \"---\") + \", \" + (museum_info['city'] if museum_info['city'] else \"---\") + \", \" + (museum_info['state'] if museum_info['state'] else \"---\") + \", \" + (museum_info['country'] if museum_info['country'] else \"---\")\n",
    "    contact_info = f\"Phone: {museum_info['phone']}\\nWebsite: {museum_info['url']}\\nAddress: {address}\"\n",
    "    contact_label = Label(content_frame, text=contact_info, font=(\"Arial\", 10))\n",
    "    contact_label.pack(pady=10)\n",
    "\n",
    "    # Display museum details (other fields from `museum_info` can also be added here)\n",
    "    more_info_label = Label(content_frame, text=\"URI:\", font=(\"Arial\", 10))\n",
    "    more_info_label.pack(pady=5)\n",
    "    \n",
    "    if museum_info['coord'] or (museum_info['address'] and museum_info['city'] and museum_info['state'] and museum_info['country']):\n",
    "        map_label = LabelFrame(content_frame)\n",
    "        map_label.pack(pady=20)\n",
    "        \n",
    "        map_widget = tkintermapview.TkinterMapView(map_label, width=800, height=600, corner_radius=0)\n",
    "        \n",
    "        if museum_info['coord']:\n",
    "            lat, lon = map(float, museum_info['coord'].split())\n",
    "            map_widget.set_position(lat, lon)\n",
    "        else:\n",
    "            map_widget.set_address(address)\n",
    "        \n",
    "        map_widget.pack()\n",
    "    else:\n",
    "        label = Label(content_frame, text=\"No info available to create a map!\", font=(\"Arial\", 12))\n",
    "        label.pack(pady=10)\n",
    "\n",
    "    painting_list = get_list_of_paintings(museum_name)\n",
    "    print(painting_list)\n",
    "    \n",
    "    # Populate the scrollable frame with data\n",
    "    for style in painting_list.keys():\n",
    "        style_label = Label(content_frame, text=style, font=(\"Arial\", 14, \"bold\"), pady=5)\n",
    "        style_label.pack(anchor=\"w\")\n",
    "        \n",
    "        for painting in painting_list[style]:\n",
    "            link = Label(content_frame, text=painting['title'], fg=\"blue\", cursor=\"hand2\", pady=2)\n",
    "            link.pack(anchor=\"w\")\n",
    "            link.bind(\"<Button-1>\", lambda e, uri=painting['uri']:show_painting_details(uri))\n",
    "    \n",
    "    # Update the scrollable region of the canvas\n",
    "    content_frame.update_idletasks()\n",
    "    canvas.config(scrollregion=canvas.bbox(\"all\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_gui(museums_by_country):\n",
    "    root = Tk()\n",
    "    root.title(\"Museums by Country\")\n",
    "\n",
    "    canvas = Canvas(root)\n",
    "    scrollbar = Scrollbar(root, orient=\"vertical\", command=canvas.yview)\n",
    "    scrollable_frame = Frame(canvas)\n",
    "\n",
    "    scrollable_frame.bind(\n",
    "        \"<Configure>\",\n",
    "        lambda e: canvas.configure(scrollregion=canvas.bbox(\"all\"))\n",
    "    )\n",
    "\n",
    "    canvas.create_window((0, 0), window=scrollable_frame, anchor=\"nw\")\n",
    "    canvas.configure(yscrollcommand=scrollbar.set)\n",
    "\n",
    "    canvas.pack(side=\"left\", fill=\"both\", expand=True)\n",
    "    scrollbar.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    # Populate the scrollable frame with data\n",
    "    for country in museums_by_country.keys():\n",
    "        country_label = Label(scrollable_frame, text=country, font=(\"Arial\", 14, \"bold\"), pady=5)\n",
    "        country_label.pack(anchor=\"w\")\n",
    "        \n",
    "        for museum in museums_by_country[country]:\n",
    "            link = Label(scrollable_frame, text=museum, fg=\"blue\", cursor=\"hand2\", pady=2)\n",
    "            link.pack(anchor=\"w\")\n",
    "            link.bind(\"<Button-1>\", lambda e, name=museum: show_museum_details(name))\n",
    "\n",
    "    root.mainloop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_list_of_paintings(museum_name):\n",
    "    q = f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        SELECT ?workLocal ?title ?style\n",
    "        WHERE {{\n",
    "            SERVICE <https://dbpedia.org/sparql> {{\n",
    "                ?workDbo a dbo:Work ;\n",
    "                         dbp:title ?title ;\n",
    "                         dbo:museum/rdfs:label \"{museum_name}\"@en .\n",
    "            }}\n",
    "            OPTIONAL {{\n",
    "                ?workLocal\n",
    "                    rdf:type dbo:Painting ;\n",
    "                    foaf:name ?titleLocal ;\n",
    "                    dbp:style/foaf:name ?style ;\n",
    "                .\n",
    "                FILTER (STR(?title) = STR(?titleLocal))\n",
    "            }}\n",
    "        }}\n",
    "    \"\"\"\n",
    "\n",
    "    painting_list = fetch_data_from_query(q, ['painting_uri', 'title','style'])\n",
    "    \n",
    "    organized = {}\n",
    "    for painting in painting_list:\n",
    "        uri = painting['painting_uri']\n",
    "        title = painting['title'] if painting['style'] else 'Untitled'\n",
    "        style = painting['style'] if painting['style'] else 'Unclassified'\n",
    "        \n",
    "        if style not in organized:\n",
    "            organized[style] = []\n",
    "        obj = {'title': title, 'uri': uri}\n",
    "        print(uri)\n",
    "        organized[style].append(obj)\n",
    "    \n",
    "    return organized"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [],
   "source": [
    "def organize_by_country(museums):\n",
    "    organized = {}\n",
    "    for museum in museums:\n",
    "        country = museum['country']\n",
    "        museum_name = museum['museum_name']\n",
    "        \n",
    "        if country not in organized:\n",
    "            organized[country] = []\n",
    "        organized[country].append(museum_name)\n",
    "    \n",
    "    return organized"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "def show_painting_details(painting_uri):\n",
    "    painting_window = Toplevel()  # Create a new top-level window\n",
    "    painting_window.title(f\"{painting_uri}\")\n",
    "\n",
    "    # Create a Canvas widget for scrolling\n",
    "    canvas = Canvas(painting_window)\n",
    "    canvas.pack(side=LEFT, fill=BOTH, expand=True)\n",
    "\n",
    "    # Create a vertical scrollbar linked to the canvas\n",
    "    scrollbar = Scrollbar(painting_window, orient=\"vertical\", command=canvas.yview)\n",
    "    scrollbar.pack(side=RIGHT, fill=\"y\")\n",
    "\n",
    "    # Configure the canvas to use the scrollbar\n",
    "    canvas.configure(yscrollcommand=scrollbar.set)\n",
    "\n",
    "    # Create a frame inside the canvas to hold all the content\n",
    "    content_frame = Frame(canvas)\n",
    "    canvas.create_window((0, 0), window=content_frame, anchor=\"nw\")\n",
    "\n",
    "    query = f\"\"\"\n",
    "            PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "\n",
    "            SELECT ?title ?artist ?style ?museum ?thumbnail\n",
    "            WHERE {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?workDbo a dbo:Work ;\n",
    "                        dbo:museum/rdfs:label ?museum ;\n",
    "                        dbo:thumbnail ?thumbnail .\n",
    "                }}\n",
    "                <{painting_uri}> foaf:name ?title ;\n",
    "                    dbp:artist/foaf:name ?artist ;\n",
    "                    dbp:style/foaf:name ?style .\n",
    "            }}\n",
    "            LIMIT 1\n",
    "        \"\"\"\n",
    "    \n",
    "    att_names = ['title', 'artist', 'style', 'museum', 'thumbnail']\n",
    "    painting_info = fetch_data_from_query(query, att_names)\n",
    "    painting_info = painting_info[0]\n",
    "    print(painting_info)\n",
    "    \n",
    "     # Title\n",
    "    title_label = Label(content_frame, text=painting_info['title'], font=(\"Arial\", 12))\n",
    "    title_label.pack(pady=10)\n",
    "\n",
    "    # Image\n",
    "    if painting_info['thumbnail']:\n",
    "        response = requests.get(painting_info['thumbnail'])\n",
    "        if response.status_code == 200:\n",
    "            thumbnail = Image.open(BytesIO(response.content))\n",
    "            test = ImageTk.PhotoImage(thumbnail)\n",
    "            label1 = Label(content_frame, image=test)\n",
    "            label1.image = test\n",
    "            label1.pack(pady=10)\n",
    "    \n",
    "    # Info\n",
    "    contact_label = Label(content_frame, text=f\"Artist: {painting_info['artist']}\", font=(\"Arial\", 10))\n",
    "    contact_label.pack(pady=5)\n",
    "    contact_label = Label(content_frame, text=f\"Style: {painting_info['style']}\", font=(\"Arial\", 10))\n",
    "    contact_label.pack(pady=5)\n",
    "    contact_label = Label(content_frame, text=f\"Museum: {painting_info['museum']}\", font=(\"Arial\", 10))\n",
    "    contact_label.pack(pady=5)\n",
    "\n",
    "    # URI\n",
    "    more_info_label = Label(content_frame, text=f\"URI: {painting_uri}\", font=(\"Arial\", 10))\n",
    "    more_info_label.pack(pady=5)\n",
    "    \n",
    "        \n",
    "        \n",
    "    #link = Label(content_frame, text=painting, fg=\"blue\", cursor=\"hand2\", pady=2)\n",
    "    #link.pack(anchor=\"w\")\n",
    "    #link.bind(\"<Button-1>\", lambda e, name=museum:show_museum_details(name))\n",
    "    \n",
    "    # Update the scrollable region of the canvas\n",
    "    content_frame.update_idletasks()\n",
    "    canvas.config(scrollregion=canvas.bbox(\"all\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#198427_Annunciation\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#29762_Annunciation\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#168000_Annunciation\n",
      "None\n",
      "None\n",
      "None\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#191514_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#7009_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#27621_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#21399_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#7865_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#21198_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#21369_PortraitofaYoungMan\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#26159_PortraitofaYoungMan\n",
      "None\n",
      "None\n",
      "None\n",
      "None\n",
      "http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#26547_SaintSebastian\n",
      "None\n",
      "{'Renaissance': [{'title': 'Annunciation', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#198427_Annunciation'}, {'title': 'Annunciation', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#168000_Annunciation'}, {'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#27621_PortraitofaYoungMan'}, {'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#21399_PortraitofaYoungMan'}, {'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#7865_PortraitofaYoungMan'}], 'Realism': [{'title': 'Annunciation', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#29762_Annunciation'}], 'Unclassified': [{'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}, {'title': 'Untitled', 'uri': None}], 'Baroque': [{'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#191514_PortraitofaYoungMan'}, {'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#21369_PortraitofaYoungMan'}, {'title': 'Saint Sebastian', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#26547_SaintSebastian'}], 'Expressionism': [{'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#7009_PortraitofaYoungMan'}], 'Cubism': [{'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#21198_PortraitofaYoungMan'}], 'Rococo': [{'title': 'Portrait of a Young Man', 'uri': 'http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#26159_PortraitofaYoungMan'}]}\n",
      "{'title': 'Portrait of a Young Man', 'artist': 'Hans Memling', 'style': 'Renaissance', 'museum': 'Capitoline Museums', 'thumbnail': \"http://commons.wikimedia.org/wiki/Special:FilePath/Constantine's_head_at_capitoline_-_Flickr_-_cking.jpg?width=300\"}\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "\n",
    "        SELECT ?country ?MuseumName\n",
    "        WHERE {\n",
    "            ?museum rdf:type dbo:Museum ;\n",
    "                    foaf:name ?MuseumName .\n",
    "            OPTIONAL { ?museum dbp:country/foaf:name ?country . }\n",
    "        }\n",
    "        ORDER BY ?country\n",
    "    \"\"\"\n",
    "att_names = ['country', 'museum_name']\n",
    "data = fetch_data_from_query(q, att_names)\n",
    "museums_by_country = organize_by_country(data)\n",
    "create_gui(museums_by_country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
