{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: rdflib in c:\\users\\henrique\\anaconda3\\lib\\site-packages (7.1.1)\n",
      "Requirement already satisfied: pyparsing<4,>=2.1.0 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from rdflib) (3.0.9)\n",
      "Requirement already satisfied: owlrl in c:\\users\\henrique\\anaconda3\\lib\\site-packages (7.1.2)\n",
      "Requirement already satisfied: rdflib>=7.1.1 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from owlrl) (7.1.1)\n",
      "Requirement already satisfied: pyparsing<4,>=2.1.0 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from rdflib>=7.1.1->owlrl) (3.0.9)\n",
      "Requirement already satisfied: geopy in c:\\users\\henrique\\anaconda3\\lib\\site-packages (2.4.1)\n",
      "Requirement already satisfied: geographiclib<3,>=1.52 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geopy) (2.0)\n",
      "Requirement already satisfied: folium in c:\\users\\henrique\\anaconda3\\lib\\site-packages (0.18.0)\n",
      "Requirement already satisfied: branca>=0.6.0 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from folium) (0.8.0)\n",
      "Requirement already satisfied: jinja2>=2.9 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from folium) (3.1.3)\n",
      "Requirement already satisfied: numpy in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from folium) (1.26.4)\n",
      "Requirement already satisfied: requests in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from folium) (2.32.3)\n",
      "Requirement already satisfied: xyzservices in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from folium) (2022.9.0)\n",
      "Requirement already satisfied: MarkupSafe>=2.0 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from jinja2>=2.9->folium) (2.1.3)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->folium) (2.0.4)\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->folium) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->folium) (2.0.7)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->folium) (2024.8.30)\n"
     ]
    }
   ],
   "source": [
    "!pip install rdflib\n",
    "!pip install owlrl\n",
    "!pip install geopy\n",
    "!pip install folium"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import re\n",
    "from DataCollector import DataCollector\n",
    "DATA_DIR = \"./src/data\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "collector = DataCollector(DATA_DIR)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, URIRef, Literal, Namespace\n",
    "from rdflib.namespace import RDF, XSD"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Criar o modelo (grafo RDF)\n",
    "model = Graph()\n",
    "\n",
    "# Definir namespaces \n",
    "base = Namespace(\"http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#\")\n",
    "xsd  = Namespace(\"http://www.w3.org/2001/XMLSchema#\")\n",
    "foaf = Namespace(\"http://xmlns.com/foaf/0.1/\")\n",
    "rdfs = Namespace(\"http://www.w3.org/2000/01/rdf-schema#\")\n",
    "rdf  = Namespace(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\")\n",
    "\n",
    "\n",
    "# Vincular os namespaces ao grafo \n",
    "model.bind(\"\", base)\n",
    "model.bind(\"xsd\", xsd)\n",
    "model.bind(\"foaf\", foaf)\n",
    "model.bind(\"rdf\", rdf)\n",
    "model.bind(\"rdfs\", rdfs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_countries_to_model():\n",
    "    countries = collector.get_countries()\n",
    "\n",
    "    for country_name in countries:\n",
    "        country_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", country_name)\n",
    "        country = URIRef(base + country_name_formated)\n",
    "        model.add((country, RDF.type, base.Country))\n",
    "        model.add((country, foaf.name, Literal(country_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_styles_to_model():\n",
    "    artist_styles = collector.get_artist_styles()\n",
    "    work_styles = collector.get_work_styles()\n",
    "    styles = set(artist_styles + work_styles)\n",
    "\n",
    "    for style_name in styles:\n",
    "        style_name_formated = \"Style_\"+re.sub(r\"[^a-zA-Z0-9]\", \"\", style_name)\n",
    "        style = URIRef(base + style_name_formated)\n",
    "        model.add((style, RDF.type, base.Style))\n",
    "        model.add((style, foaf.name, Literal(style_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_subjects_to_model():\n",
    "    subjects = collector.get_subjects()\n",
    "\n",
    "    for subject_name in subjects:\n",
    "        subject_name_formated = \"Subject_\"+re.sub(r\"[^a-zA-Z0-9]\", \"\", subject_name)\n",
    "        subject = URIRef(base + subject_name_formated)\n",
    "        model.add((subject, RDF.type, base.Subject))\n",
    "        model.add((subject, foaf.name, Literal(subject_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_nationalities_to_model():\n",
    "    nationalities = collector.get_artist_nationalities()\n",
    "\n",
    "    for nationality_name in nationalities:\n",
    "        nationality_name_formated = re.sub(r\"[^a-zA-Z0-9]\", \"\", nationality_name)\n",
    "        nationality = URIRef(base + nationality_name_formated)\n",
    "        model.add((nationality, RDF.type, base.Nationality))\n",
    "        model.add((nationality, foaf.name, Literal(nationality_name)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_museums_to_model():\n",
    "    data = collector.get_museums()\n",
    "    tam = data.shape[0]\n",
    "    \n",
    "    for i in range (tam):\n",
    "        museum_identifier = data.iloc[i][\"identifier\"]\n",
    "        museum = URIRef(base + museum_identifier)\n",
    "        model.add((museum, RDF.type, base.Museum))\n",
    "\n",
    "        museum_name = str(data.iloc[i][\"name\"])\n",
    "        model.add((museum, foaf.name, Literal(museum_name)))\n",
    "\n",
    "        country_name = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"country\"]))\n",
    "        if country_name != \"nan\":\n",
    "            model.add((museum, base.hasCountry, URIRef(base + country_name )))\n",
    "\n",
    "        state = str(data.iloc[i][\"state\"])\n",
    "        if state != \"nan\":\n",
    "            model.add((museum, base.state, Literal(state)))\n",
    "        \n",
    "        city = str(data.iloc[i][\"city\"])\n",
    "        if city != \"nan\":\n",
    "            model.add((museum, base.city, Literal(city)))\n",
    "        \n",
    "        address = str(data.iloc[i][\"address\"])\n",
    "        if address != \"nan\":\n",
    "            model.add((museum, base.address, Literal(address)))\n",
    "        \n",
    "        postal = str(data.iloc[i][\"postal\"])\n",
    "        if postal != \"nan\":\n",
    "            model.add((museum, base.postal, Literal(postal)))\n",
    "        \n",
    "        phone = str(data.iloc[i][\"phone\"])\n",
    "        if phone != \"nan\":\n",
    "            model.add((museum, base.phone, Literal(phone)))\n",
    "        \n",
    "        url = str(data.iloc[i][\"url\"])\n",
    "        if city != \"nan\":\n",
    "            model.add((museum, base.url, Literal(url)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_artists_to_model():\n",
    "    data = collector.get_artists()\n",
    "    tam = data.shape[0]\n",
    "    \n",
    "    for i in range (tam):\n",
    "        artist_identifier = data.iloc[i][\"identifier\"]\n",
    "        artist = URIRef(base + artist_identifier)\n",
    "        model.add((artist, RDF.type, base.Artist))\n",
    "\n",
    "        full_name = str(data.iloc[i][\"full_name\"])\n",
    "        model.add((artist, foaf.name, Literal(full_name)))\n",
    "\n",
    "        first_name = str(data.iloc[i][\"first_name\"])\n",
    "        if first_name != \"nan\":\n",
    "            model.add((artist, foaf.firstName, Literal(first_name)))\n",
    "\n",
    "        last_name = str(data.iloc[i][\"last_name\"])\n",
    "        if last_name != \"nan\":\n",
    "            model.add((artist, foaf.lastName, Literal(last_name)))\n",
    "        \n",
    "        birth = str(data.iloc[i][\"birth\"])\n",
    "        if birth != \"nan\":\n",
    "            model.add((artist, base.birth, Literal(birth)))\n",
    "\n",
    "        death = str(data.iloc[i][\"death\"])\n",
    "        if death != \"nan\":\n",
    "            model.add((artist, base.death, Literal(death)))\n",
    "        \n",
    "        nationality = re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"nationality\"]))\n",
    "        if nationality != \"nan\":\n",
    "            model.add((artist, base.hasNationality, URIRef(base + nationality )))\n",
    "        \n",
    "        style = \"Style_\"+re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"style\"]))\n",
    "        if style != \"nan\":\n",
    "            model.add((artist, base.hasStyle, URIRef(base + \"Style_\"+ style )))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_works_to_model():\n",
    "    data = collector.get_works()\n",
    "    tam = data.shape[0]\n",
    "\n",
    "    for i in range (tam):\n",
    "        work_identifier = data.iloc[i][\"identifier\"]\n",
    "        work = URIRef(base + work_identifier)\n",
    "        model.add((work, RDF.type, base.Work))\n",
    "\n",
    "        name = str(data.iloc[i][\"name\"])\n",
    "        model.add((work, foaf.name, Literal(name)))\n",
    "\n",
    "        artist = collector.get_artist_by_id(data.iloc[i][\"artist_id\"])\n",
    "        if artist is not None:\n",
    "            model.add((work, base.wasPaintedBy, URIRef(base + artist )))\n",
    "        \n",
    "        style = \"Style_\" + re.sub(r\"[^a-zA-Z0-9]\", \"\", str(data.iloc[i][\"style\"]))\n",
    "        if style != \"nan\":\n",
    "            model.add((work, base.hasStyle, URIRef(base + \"Style_\"+ style )))\n",
    "        \n",
    "        subject = collector.get_subject_by_id(data.iloc[i][\"work_id\"])\n",
    "        if subject is not None:\n",
    "            model.add((work, base.hasSubject, URIRef(base + subject )))\n",
    "\n",
    "        museum_id = data.iloc[i][\"museum_id\"]\n",
    "        if museum_id != \"nan\":\n",
    "            work_museum = collector.get_museum_by_id(museum_id)\n",
    "            if work_museum is not None:\n",
    "                model.add((work, base.isLocatedAt, URIRef(base + work_museum)))\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_nationalities_to_model()\n",
    "add_subjects_to_model()\n",
    "add_countries_to_model()\n",
    "add_styles_to_model()\n",
    "add_works_to_model()\n",
    "add_museums_to_model()\n",
    "add_artists_to_model()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Serializar o grafo para um arquivo ou string\n",
    "output_file = \"output.ttl\"  \n",
    "with open(output_file, \"w\", encoding=\"utf-8\") as fout:\n",
    "    fout.write(model.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "from owlrl import DeductiveClosure, RDFS_Semantics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Modelo inferido:\n"
     ]
    }
   ],
   "source": [
    "schema_file = \"./famouspaintings.ttl\"\n",
    "data_file = \"./output.ttl\"\n",
    "\n",
    "schema = Graph()\n",
    "schema.parse(schema_file)  # Ler o esquema\n",
    "\n",
    "data = Graph()\n",
    "data.parse(data_file, format=\"turtle\")  # Ler os dados \n",
    "\n",
    "inferred_model = Graph()\n",
    "inferred_model += schema\n",
    "inferred_model += data\n",
    "\n",
    "DeductiveClosure(RDFS_Semantics).expand(inferred_model)  # Inferência RDFS\n",
    "\n",
    "print(\"Modelo inferido:\")\n",
    "output_file2 = \"output2.ttl\"  \n",
    "with open(output_file2, \"w\", encoding='utf-8') as fout:\n",
    "    fout.write(inferred_model.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "museums = collector.get_museums()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "museums_name = museums[\"name\"].tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Latitude: 29.7250839, Longitude: -95.38948566052063\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div style=\"width:100%;\"><div style=\"position:relative;width:100%;height:0;padding-bottom:60%;\"><span style=\"color:#565656\">Make this Notebook Trusted to load map: File -> Trust Notebook</span><iframe srcdoc=\"&lt;!DOCTYPE html&gt;\n",
       "&lt;html&gt;\n",
       "&lt;head&gt;\n",
       "    \n",
       "    &lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=UTF-8&quot; /&gt;\n",
       "    \n",
       "        &lt;script&gt;\n",
       "            L_NO_TOUCH = false;\n",
       "            L_DISABLE_3D = false;\n",
       "        &lt;/script&gt;\n",
       "    \n",
       "    &lt;style&gt;html, body {width: 100%;height: 100%;margin: 0;padding: 0;}&lt;/style&gt;\n",
       "    &lt;style&gt;#map {position:absolute;top:0;bottom:0;right:0;left:0;}&lt;/style&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://code.jquery.com/jquery-3.7.1.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/js/bootstrap.bundle.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap-glyphicons.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/@fortawesome/fontawesome-free@6.2.0/css/all.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/gh/python-visualization/folium/folium/templates/leaflet.awesome.rotate.min.css&quot;/&gt;\n",
       "    \n",
       "            &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width,\n",
       "                initial-scale=1.0, maximum-scale=1.0, user-scalable=no&quot; /&gt;\n",
       "            &lt;style&gt;\n",
       "                #map_4d8f93e43540f1572e61da2f0bd04b58 {\n",
       "                    position: relative;\n",
       "                    width: 800.0px;\n",
       "                    height: 400.0px;\n",
       "                    left: 0.0%;\n",
       "                    top: 0.0%;\n",
       "                }\n",
       "                .leaflet-container { font-size: 1rem; }\n",
       "            &lt;/style&gt;\n",
       "        \n",
       "&lt;/head&gt;\n",
       "&lt;body&gt;\n",
       "    \n",
       "    \n",
       "            &lt;div class=&quot;folium-map&quot; id=&quot;map_4d8f93e43540f1572e61da2f0bd04b58&quot; &gt;&lt;/div&gt;\n",
       "        \n",
       "&lt;/body&gt;\n",
       "&lt;script&gt;\n",
       "    \n",
       "    \n",
       "            var map_4d8f93e43540f1572e61da2f0bd04b58 = L.map(\n",
       "                &quot;map_4d8f93e43540f1572e61da2f0bd04b58&quot;,\n",
       "                {\n",
       "                    center: [29.7250839, -95.38948566052063],\n",
       "                    crs: L.CRS.EPSG3857,\n",
       "                    zoom: 50,\n",
       "                    zoomControl: true,\n",
       "                    preferCanvas: false,\n",
       "                }\n",
       "            );\n",
       "\n",
       "            \n",
       "\n",
       "        \n",
       "    \n",
       "            var tile_layer_1f8806380ba03d28d78b51d1c4bb623f = L.tileLayer(\n",
       "                &quot;https://tile.openstreetmap.org/{z}/{x}/{y}.png&quot;,\n",
       "                {&quot;attribution&quot;: &quot;\\u0026copy; \\u003ca href=\\&quot;https://www.openstreetmap.org/copyright\\&quot;\\u003eOpenStreetMap\\u003c/a\\u003e contributors&quot;, &quot;detectRetina&quot;: false, &quot;maxNativeZoom&quot;: 19, &quot;maxZoom&quot;: 19, &quot;minZoom&quot;: 0, &quot;noWrap&quot;: false, &quot;opacity&quot;: 1, &quot;subdomains&quot;: &quot;abc&quot;, &quot;tms&quot;: false}\n",
       "            );\n",
       "        \n",
       "    \n",
       "            tile_layer_1f8806380ba03d28d78b51d1c4bb623f.addTo(map_4d8f93e43540f1572e61da2f0bd04b58);\n",
       "        \n",
       "    \n",
       "            var marker_c2155b4e9e8f6579c4ed8f4b146bcc7c = L.marker(\n",
       "                [29.7250839, -95.38948566052063],\n",
       "                {}\n",
       "            ).addTo(map_4d8f93e43540f1572e61da2f0bd04b58);\n",
       "        \n",
       "    \n",
       "        var popup_636555939bd6daf3046d710d97e8f443 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_c3639c6a9603de0ccd5a2b1bf86b0b85 = $(`&lt;div id=&quot;html_c3639c6a9603de0ccd5a2b1bf86b0b85&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;The postcode brought me here&lt;/div&gt;`)[0];\n",
       "                popup_636555939bd6daf3046d710d97e8f443.setContent(html_c3639c6a9603de0ccd5a2b1bf86b0b85);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_c2155b4e9e8f6579c4ed8f4b146bcc7c.bindPopup(popup_636555939bd6daf3046d710d97e8f443)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "&lt;/script&gt;\n",
       "&lt;/html&gt;\" style=\"position:absolute;width:100%;height:100%;left:0;top:0;border:none !important;\" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe></div></div>"
      ],
      "text/plain": [
       "<folium.folium.Map at 0x1a5fca0a610>"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from geopy.geocoders import Nominatim\n",
    "import random\n",
    "\n",
    "def obter_lat_lon_nominatim(endereco):\n",
    "    geolocator = Nominatim(user_agent=\"sua_aplicacao\")\n",
    "    localizacao = geolocator.geocode(endereco)\n",
    "    if localizacao:\n",
    "        return localizacao.latitude, localizacao.longitude\n",
    "    else:\n",
    "        print(\"Endereço não encontrado\")\n",
    "        return None, None\n",
    "\n",
    "# Exemplo de uso\n",
    "elemento_aleatorio = random.choice(museums_name)\n",
    "endereco = random.choice(museums_name)\n",
    "latitude, longitude = obter_lat_lon_nominatim(endereco)\n",
    "print(f\"Latitude: {latitude}, Longitude: {longitude}\")\n",
    "\n",
    "import folium\n",
    "\n",
    "# create tuples representing our location\n",
    "location = float(latitude), float(longitude)\n",
    "\n",
    "# center the map \n",
    "center = (latitude, longitude)\n",
    "\n",
    "# create a Folium map centred at the above location\n",
    "m = folium.Map(location=center, zoom_start=50, width=800, height=400)\n",
    "\n",
    "# add markers at the locations\n",
    "folium.Marker(location, popup=\"The postcode brought me here\").add_to(m)\n",
    "\n",
    "# refer to the map to display it in Jupyter/Colab notebooks\n",
    "m"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Adèle Romany | 1769 | 1846 | NULL | French\n",
      "Adélaïde Labille-Guiard | 1749 | 1803 | NULL | French\n",
      "Adolph Ulrich Wertmuller | 1751 | 1811 | NULL | Swiss\n",
      "Adriaen Thomasz. Key | 1544 | 1589 | NULL | Dutch\n",
      "Adriaan De Lelie | 1755 | 1820 | NULL | Dutch\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de artistas por inicio do nome\n",
    "searchQuery = 'Ad'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?artistName ?birth ?death ?style ?nationality\n",
    "        WHERE {{\n",
    "            ?artist\n",
    "                rdf:type :Artist ;\n",
    "                foaf:name ?artistName ;\n",
    "            .\n",
    "            OPTIONAL {{?artist :birth ?birth .}}\n",
    "            OPTIONAL {{?artist :death ?death .}}\n",
    "            OPTIONAL {{?artist :hasStyle/foaf:name ?style .}}\n",
    "            OPTIONAL {{?artist :hasNationality/foaf:name ?nationality .}}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?artistName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Museo Thyssen-Bornemisza | Spain | NULL | Madrid | P.º del Prado, 8 | 28014 | + 34 917 91 13 70 | https://www.museothyssen.org/en\n",
      "Museum Folkwang | Germany | Essen | 45128 | Museumsplatz 1 | NULL | 49 201 8845000 | https://www.museum-folkwang.de/en\n",
      "Museum of Fine Arts Boston | USA | MA | Boston | 465 Huntington Ave | 2115 | 617-267-9300 | https://www.mfa.org/\n",
      "Musée du Louvre | France | Paris | 75001 | Rue de Rivoli | NULL | 33 1 40 20 50 50 | https://www.louvre.fr/en\n",
      "Musée d'Orsay | France | NULL | Paris | 1 Rue de la Légion d'Honneur | 75007 | +33 (0)1 40 49 48 14 | https://www.musee-orsay.fr/en\n",
      "Museo del Prado | Spain | NULL | Madrid | C. de Ruiz de Alarcón, 23 | 28014 | +34 913 30 28 00 | https://www.museodelprado.es/en\n",
      "Museum of Fine Arts | Switzerland | NULL | Bern | Hodlerstrasse 8 | 3011 | +41 31 328 09 44 | https://www.kunstmuseumbern.ch/en/\n",
      "Museum Legion of Honor | USA | CA | San Francisco | 100 34th  Avenue | 94121 | +1 415 750-3600 | https://www.famsf.org/\n",
      "Musée des Beaux-Arts Quimper | France | Quimper | 29000 | 40 Pl. Saint-Corentin | NULL | 33 2 98 95 45 20 | https://www.mbaq.fr/en/home-3.html\n",
      "Museé de Grenoble | France | Grenoble | 38000 | 5 Pl. de Lavalette | NULL | 33 4 76 63 44 44 | https://www.museedegrenoble.fr/1986-the-museum-in-english.htm\n",
      "Musée des Beaux-Arts Nancy | France | NULL | Nancy | 3 Pl. Stanislas | 54000 | +33 3 83 85 30 01 | https://useum.org/museum/Museum-of-Fine-Arts-of-Nancy\n",
      "Musée Marmottan Monet | France | NULL | Paris | 2 Rue Louis Boilly | 75016 | +33 1 44 96 50 33 | https://www.marmottan.fr/en/\n",
      "Museum of Fine Arts, Houston | USA | TX | Houston | 1001 Bissonnet St | 77005 | +1 713 639-7300 | https://www.mfah.org/\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de museus por inicio do nome\n",
    "searchQuery = 'Mus'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?museumName ?country ?state ?city ?address ?postal ?phone ?url\n",
    "        WHERE {{\n",
    "            ?museum\n",
    "                rdf:type :Museum ;\n",
    "                foaf:name ?museumName ;\n",
    "            .\n",
    "            OPTIONAL {{?museum :hasCountry/foaf:name ?country .}}\n",
    "            OPTIONAL {{?museum :state ?state .}}\n",
    "            OPTIONAL {{?museum :city ?city .}}\n",
    "            OPTIONAL {{?museum :address ?address .}}\n",
    "            OPTIONAL {{?museum :postal ?postal .}}\n",
    "            OPTIONAL {{?museum :phone ?phone .}}\n",
    "            OPTIONAL {{?museum :url ?url .}}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?museumName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Grand Canal, Venice | Joseph M. W. Turner | NULL | Rivers/Lakes | The Metropolitan Museum of Art\n",
      "The Grand Canal in Venice from Palazzo Flangini to Campo San Marcuola | Canaletto | NULL | Architectures | The J. Paul Getty Museum\n",
      "The Grand Canal with San Simeone Piccolo, Venice | Canaletto | NULL | Architectures | National Gallery\n",
      "The Grand Canal, Venice | Édouard Manet | NULL | Rivers/Lakes | NULL\n",
      "The Grand Vizier Crossing the Atmeydani (Horse Square) | Jean Baptiste Vanmour | NULL | NULL | Rijksmuseum\n",
      "The Grand Canyon of the Colorado | Thomas Moran | NULL | Landscape Art | NULL\n",
      "The Grand Canal Blue Venice | Édouard Manet | NULL | Rivers/Lakes | NULL\n",
      "The Grand Canal and Santa Maria della Salute | Claude Monet | NULL | Rivers/Lakes | NULL\n",
      "The Grand Canal in Venice | Albert Marquet | NULL | Rivers/Lakes | NULL\n",
      "The Grands Boulevards | Pierre-Auguste Renoir | NULL | NULL | Philadelphia Museum of Art\n",
      "The Grand Canal in Venice with Palazzo Bembo | Francesco Guardi | NULL | Architectures | The J. Paul Getty Museum\n",
      "The Grand Bath at Bursa | Jean-Léon Gérôme | NULL | Nude | NULL\n",
      "The Grand Nude | Amedeo Modigliani | NULL | Nude | The Museum of Modern Art\n",
      "The Grand White Eunuch | Jean-Léon Gérôme | NULL | NULL | NULL\n",
      "The Grand Canal with the Church of San Stae, Venice | Canaletto | NULL | Architectures | NULL\n",
      "The Grand Canal | Claude Monet | NULL | Rivers/Lakes | Museum of Fine Arts Boston\n",
      "The Grand Canal from Palazzo Flangini to Campo San Marcuola | Canaletto | NULL | Architectures | NULL\n",
      "The Grand Canyon of the Yellowstone | Thomas Moran | NULL | Landscape Art | NULL\n",
      "The Grand Canal from Campo S. Vio towards the Bacino | Canaletto | NULL | Architectures | NULL\n",
      "The Grande Creuse at Pont de Vervy | Claude Monet | NULL | NULL | Philadelphia Museum of Art\n",
      "The Grand Canal Above the Rialto | Francesco Guardi | NULL | Architectures | The Metropolitan Museum of Art\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de obras por inicio do nome\n",
    "searchQuery = 'The Grand'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?workName ?artist ?style ?subject ?location\n",
    "        WHERE {{\n",
    "            ?work\n",
    "                rdf:type :Work ;\n",
    "                foaf:name ?workName ;\n",
    "            .\n",
    "            OPTIONAL {{?work :wasPaintedBy/foaf:name ?artist .}}\n",
    "            OPTIONAL {{?work :hasStyle/foaf:name ?style .}}\n",
    "            OPTIONAL {{?work :hasSubject/foaf:name ?subject .}}\n",
    "            OPTIONAL {{?work :isLocatedAt/foaf:name ?location .}}\n",
    "            FILTER (STRSTARTS(LCASE(STR(?workName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "American West\n",
      "American Art\n",
      "American Landscape\n",
      "America West\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de estilos por inicio do nome\n",
    "searchQuery = 'America'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?styleName\n",
    "        WHERE {{\n",
    "            ?style\n",
    "                rdf:type :Style ;\n",
    "                foaf:name ?styleName ;\n",
    "            .\n",
    "            FILTER (STRSTARTS(LCASE(STR(?styleName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Autumn/Fall\n",
      "Abstract/Modern Art\n",
      "Architectures\n"
     ]
    }
   ],
   "source": [
    "# Pesquisando dados de temas por inicio do nome\n",
    "searchQuery = 'A'.lower()\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?subjectName\n",
    "        WHERE {{\n",
    "            ?subject\n",
    "                rdf:type :Subject ;\n",
    "                foaf:name ?subjectName ;\n",
    "            .\n",
    "            FILTER (STRSTARTS(LCASE(STR(?subjectName)), \"{searchQuery}\"))\n",
    "        }}\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Bottle, Glass, Fork | NULL\n",
      "Stag at Sharkey's | NULL\n",
      "Constellations | NULL\n",
      "The Large Plane Trees | NULL\n",
      "Cleveland Apollo | NULL\n",
      "Fall of Simon Magus | NULL\n",
      "The Crucifixion of Saint Andrew | NULL\n",
      "Un lièvre et un gigot de mouton | NULL\n",
      "La Vie | NULL\n",
      "Source | NULL\n"
     ]
    }
   ],
   "source": [
    "# Listar 10 obras de um museu junto com o estilo daquela obra\n",
    "museumURL = 'http://www.clevelandart.org/'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        SELECT ?title ?style\n",
    "        WHERE {{\n",
    "            SERVICE <https://dbpedia.org/sparql> {{\n",
    "                ?workDbo a dbo:Work ;\n",
    "                         dbp:title ?title ;\n",
    "                         dbo:museum/dbp:website <{museumURL}> .\n",
    "            }}\n",
    "            OPTIONAL {{\n",
    "                ?workLocal\n",
    "                    rdf:type :Work ;\n",
    "                    foaf:name ?titleLocal ;\n",
    "                    :hasStyle/foaf:name ?style ;\n",
    "                .\n",
    "                FILTER (STR(?title) = STR(?titleLocal))\n",
    "            }}\n",
    "        }}\n",
    "        LIMIT 10\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': 'http://dbpedia.org/resource/',\n",
    "        'dbo': 'http://dbpedia.org/ontology/',\n",
    "        'dbp': 'http://dbpedia.org/property/',\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1749 | 1803 | NULL | French | http://commons.wikimedia.org/wiki/Special:FilePath/Adélaïde_Labille-Guiard_-_Self-Portrait_with_Two_Pupils_-_The_Metropolitan_Museum_of_Art.jpg?width=300\n"
     ]
    }
   ],
   "source": [
    "# Retornar os dados e a imagem de um artista pelo nome\n",
    "artistName = 'Adélaïde Labille-Guiard'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?birth ?death ?style ?nationality ?image\n",
    "        WHERE {{\n",
    "            OPTIONAL {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?artistDbo a dbo:Animal ;\n",
    "                        rdfs:label \"{artistName}\"@en ;\n",
    "                        dbo:thumbnail ?image .\n",
    "                }}\n",
    "            }}\n",
    "            ?artist\n",
    "                rdf:type :Artist ;\n",
    "                foaf:name \"{artistName}\" ;\n",
    "            .\n",
    "            OPTIONAL {{?artist :birth ?birth .}}\n",
    "            OPTIONAL {{?artist :death ?death .}}\n",
    "            OPTIONAL {{?artist :hasStyle/foaf:name ?style .}}\n",
    "            OPTIONAL {{?artist :hasNationality/foaf:name ?nationality .}}\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': 'http://dbpedia.org/resource/',\n",
    "        'dbo': 'http://dbpedia.org/ontology/',\n",
    "        'dbp': 'http://dbpedia.org/property/',\n",
    "        'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "United Kingdom | SE10 9NF | London | Romney Rd | NULL | 44 20 8858 4422 | https://www.rmg.co.uk/national-maritime-museum | 51.481111 -0.005556\n"
     ]
    }
   ],
   "source": [
    "# Retornar os dados e as coordenadas de um museu pelo nome\n",
    "museumName = 'National Maritime Museum'\n",
    "qres = inferred_model.query(\n",
    "    f\"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        \n",
    "        SELECT ?country ?state ?city ?address ?postal ?phone ?url ?coords\n",
    "        WHERE {{\n",
    "            OPTIONAL {{\n",
    "                SERVICE <https://dbpedia.org/sparql> {{\n",
    "                    ?museumDbo a dbo:Building ;\n",
    "                        rdfs:label \"{museumName}\"@en ;\n",
    "                        georss:point ?coords .\n",
    "                }}\n",
    "            }}\n",
    "            ?museum\n",
    "                rdf:type :Museum ;\n",
    "                foaf:name \"{museumName}\" ;\n",
    "            .\n",
    "            OPTIONAL {{?museum :hasCountry/foaf:name ?country .}}\n",
    "            OPTIONAL {{?museum :state ?state .}}\n",
    "            OPTIONAL {{?museum :city ?city .}}\n",
    "            OPTIONAL {{?museum :address ?address .}}\n",
    "            OPTIONAL {{?museum :postal ?postal .}}\n",
    "            OPTIONAL {{?museum :phone ?phone .}}\n",
    "            OPTIONAL {{?museum :url ?url .}}\n",
    "        }}\n",
    "        LIMIT 1\n",
    "    \"\"\",\n",
    "    initNs={\n",
    "        'rdf': rdf,\n",
    "        'foaf': foaf,\n",
    "        'dbr': 'http://dbpedia.org/resource/',\n",
    "        'dbo': 'http://dbpedia.org/ontology/',\n",
    "        'dbp': 'http://dbpedia.org/property/',\n",
    "        'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
    "        'georss': 'http://www.georss.org/georss/',\n",
    "    }\n",
    ")\n",
    "\n",
    "for row in qres:\n",
    "    print(' | '.join([e or 'NULL' for e in row]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: tkintermapview in c:\\users\\henrique\\anaconda3\\lib\\site-packages (1.29)\n",
      "Requirement already satisfied: geocoder in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (1.38.1)\n",
      "Requirement already satisfied: pillow in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (10.2.0)\n",
      "Requirement already satisfied: requests in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (2.32.3)\n",
      "Requirement already satisfied: pyperclip in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (1.9.0)\n",
      "Requirement already satisfied: customtkinter in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (5.2.2)\n",
      "Requirement already satisfied: pywin32 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from tkintermapview) (305.1)\n",
      "Requirement already satisfied: darkdetect in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from customtkinter->tkintermapview) (0.8.0)\n",
      "Requirement already satisfied: packaging in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from customtkinter->tkintermapview) (23.1)\n",
      "Requirement already satisfied: click in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (8.1.7)\n",
      "Requirement already satisfied: future in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (0.18.3)\n",
      "Requirement already satisfied: ratelim in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (0.1.6)\n",
      "Requirement already satisfied: six in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from geocoder->tkintermapview) (1.16.0)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (2.0.4)\n",
      "Requirement already satisfied: idna<4,>=2.5 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (2.0.7)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from requests->tkintermapview) (2024.8.30)\n",
      "Requirement already satisfied: colorama in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from click->geocoder->tkintermapview) (0.4.6)\n",
      "Requirement already satisfied: decorator in c:\\users\\henrique\\anaconda3\\lib\\site-packages (from ratelim->geocoder->tkintermapview) (5.1.1)\n"
     ]
    }
   ],
   "source": [
    "!pip install tkintermapview"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tkinter import *\n",
    "import tkinter as ttk\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import webbrowser\n",
    "import tkintermapview\n",
    "\n",
    "# Function to fetch museums by country using a corrected query\n",
    "def fetch_museums_by_country(search_query=\"\"):\n",
    "    qres = inferred_model.query(\n",
    "        \"\"\"\n",
    "        PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "\n",
    "        SELECT ?country ?countryName ?museum ?museumName\n",
    "        WHERE {\n",
    "            ?museum\n",
    "                rdf:type :Museum ;\n",
    "                :hasCountry ?country ;\n",
    "                foaf:name ?museumName .\n",
    "            ?country foaf:name ?countryName .\n",
    "        }\n",
    "        ORDER BY ?countryName ?museumName\n",
    "        \"\"\"\n",
    "    )\n",
    "\n",
    "    data = {}\n",
    "    for row in qres:\n",
    "        country = str(row[1])  # Country name\n",
    "        museumURI = str(row[2])  # Museum URI\n",
    "        museumName = str(row[3])  # Museum name\n",
    "\n",
    "        if country not in data:\n",
    "            data[country] = []\n",
    "        # Append a single dictionary with both name and URI\n",
    "        data[country].append({\"name\": museumName, \"uri\": museumURI})\n",
    "    return data\n",
    "\n",
    "# Function to display museum details and the map\n",
    "def show_museum_details(museum_name, museum_uri):\n",
    "    museum_window = Toplevel()  # Create a new top-level window\n",
    "    museum_window.title(f\"{museum_name}\")\n",
    "\n",
    "    museum_info = get_museum_info(museum_name)  # Fetch museum information by URI\n",
    "\n",
    "    # Add some content about the museum\n",
    "    label = Label(museum_window, text=f\"Details about the museum: {museum_name}\", font=(\"Arial\", 12))\n",
    "    label.pack(pady=10)\n",
    "\n",
    "    # Display museum details (other fields from `museum_info` can also be added here)\n",
    "    more_info_label = Label(museum_window, text=f\"URI: {museum_uri}\", font=(\"Arial\", 10))\n",
    "    more_info_label.pack(pady=5)\n",
    "\n",
    "    if museum_info['coord'] or (museum_info['address'] and museum_info['city'] and museum_info['state'] and museum_info['country']):\n",
    "        \n",
    "        \n",
    "        map_label = LabelFrame(museum_window)\n",
    "        map_label.pack(pady=20)\n",
    "        \n",
    "        map_widget = tkintermapview.TkinterMapView(map_label, width=800, height=600, corner_radius=0)\n",
    "        \n",
    "        if museum_info['coord']:\n",
    "            lat, lon = map(float, museum_info['coord'].split())\n",
    "            map_widget.set_position(lat, lon)\n",
    "        else:\n",
    "            address = museum_info['address'] + \", \" + museum_info['city'] + \", \" + museum_info['state'] + \", \" + museum_info['country']\n",
    "            map_widget.set_address(address)\n",
    "        \n",
    "        map_widget.pack()\n",
    "    else:\n",
    "        label = Label(museum_window, text=\"No coordinates available to create a map!\", font=(\"Arial\", 12))\n",
    "        label.pack(pady=10)\n",
    "\n",
    "    # Add a button to close the details window\n",
    "    close_button = Button(museum_window, text=\"Close\", command=museum_window.destroy)\n",
    "    close_button.pack(pady=10)\n",
    "\n",
    "# Build the Tkinter GUI\n",
    "def create_gui(museums_by_country):\n",
    "    root = Tk()\n",
    "    root.title(\"Museums by Country\")\n",
    "\n",
    "    canvas = Canvas(root)\n",
    "    scrollbar = ttk.Scrollbar(root, orient=\"vertical\", command=canvas.yview)\n",
    "    scrollable_frame = ttk.Frame(canvas)\n",
    "\n",
    "    scrollable_frame.bind(\n",
    "        \"<Configure>\",\n",
    "        lambda e: canvas.configure(scrollregion=canvas.bbox(\"all\"))\n",
    "    )\n",
    "\n",
    "    canvas.create_window((0, 0), window=scrollable_frame, anchor=\"nw\")\n",
    "    canvas.configure(yscrollcommand=scrollbar.set)\n",
    "\n",
    "    canvas.pack(side=\"left\", fill=\"both\", expand=True)\n",
    "    scrollbar.pack(side=\"right\", fill=\"y\")\n",
    "\n",
    "    # Populate the scrollable frame with data\n",
    "    for country, museums in museums_by_country.items():\n",
    "        country_label = Label(scrollable_frame, text=country, font=(\"Arial\", 14, \"bold\"), pady=5)\n",
    "        country_label.pack(anchor=\"w\")\n",
    "        for museum in museums:\n",
    "            link = Label(scrollable_frame, text=museum[\"name\"], fg=\"blue\", cursor=\"hand2\", pady=2)\n",
    "            link.pack(anchor=\"w\")\n",
    "            link.bind(\"<Button-1>\", lambda e, name=museum[\"name\"], uri=museum[\"uri\"]: show_museum_details(name, uri))\n",
    "\n",
    "    root.mainloop()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_map(lat, lon):\n",
    "    map_ = folium.Map(location=[lat, lon], zoom_start=15)\n",
    "    folium.Marker([lat, lon], popup=\"Museum Location\").add_to(map_)\n",
    "    file_path = \"map.html\"\n",
    "    map_.save(file_path)\n",
    "    return file_path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_museum_info(museum_name):\n",
    "    print(museum_name)\n",
    "    qres_museum = inferred_model.query(\n",
    "        f\"\"\"\n",
    "            PREFIX : <http://www.semanticweb.org/ericarfs/ontologies/2024/10/famouspaintings#>\n",
    "\n",
    "            SELECT ?country ?state ?city ?address ?postal ?phone ?url ?coords\n",
    "            WHERE {{\n",
    "                OPTIONAL {{\n",
    "                    SERVICE <https://dbpedia.org/sparql> {{\n",
    "                        ?museumDbo a dbo:Building ;\n",
    "                            rdfs:label \"{museum_name}\"@en ;\n",
    "                            georss:point ?coords .\n",
    "                    }}\n",
    "                }}\n",
    "                ?museum\n",
    "                    rdf:type :Museum ;\n",
    "                    foaf:name \"{museum_name}\" ;\n",
    "                .\n",
    "                OPTIONAL {{?museum :hasCountry/foaf:name ?country .}}\n",
    "                OPTIONAL {{?museum :state ?state .}}\n",
    "                OPTIONAL {{?museum :city ?city .}}\n",
    "                OPTIONAL {{?museum :address ?address .}}\n",
    "                OPTIONAL {{?museum :postal ?postal .}}\n",
    "                OPTIONAL {{?museum :phone ?phone .}}\n",
    "                OPTIONAL {{?museum :url ?url .}}\n",
    "            }}\n",
    "            LIMIT 1\n",
    "        \"\"\",\n",
    "        initNs={\n",
    "            'rdf': rdf,\n",
    "            'foaf': foaf,\n",
    "            'dbr': 'http://dbpedia.org/resource/',\n",
    "            'dbo': 'http://dbpedia.org/ontology/',\n",
    "            'dbp': 'http://dbpedia.org/property/',\n",
    "            'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
    "            'georss': 'http://www.georss.org/georss/',\n",
    "        }\n",
    "    )\n",
    "\n",
    "    for row in qres_museum:\n",
    "        country = str(row[0]) if row[0] else None\n",
    "        city = str(row[1]) if row[1] else None\n",
    "        state = str(row[2]) if row[2] else None\n",
    "        address = str(row[3]) if row[3] else None\n",
    "        postal = str(row[4]) if row[4] else None\n",
    "        phone = str(row[5]) if row[5] else None\n",
    "        url = str(row[6]) if row[6] else None\n",
    "        coord = str(row[7]) if row[7] else None\n",
    "        break\n",
    "    \n",
    "    # Build the dictionary\n",
    "    data = {\n",
    "        \"country\": country,\n",
    "        \"city\": city,\n",
    "        \"state\": state,\n",
    "        \"address\": address,\n",
    "        \"postal\": postal,\n",
    "        \"phone\": phone,\n",
    "        \"url\": url,\n",
    "        \"coord\": coord,\n",
    "    }\n",
    "\n",
    "    # Return the data\n",
    "    print(data)\n",
    "    return data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "National Gallery of Victoria\n",
      "{'country': 'Australia', 'city': 'Victoria', 'state': 'Melbourne', 'address': '180 St Kilda Rd', 'postal': '3004', 'phone': '+61 (0)3 8620 2222', 'url': 'https://www.ngv.vic.gov.au/', 'coord': '-37.822595 144.968634'}\n",
      "São Paulo Museum of Art\n",
      "{'country': 'Brazil', 'city': None, 'state': 'São Paulo', 'address': 'Av. Paulista, 1578 - Bela Vista', 'postal': '01310-200', 'phone': '+55 11 3149-5959', 'url': 'https://masp.org.br/', 'coord': None}\n",
      "National Gallery Prague\n",
      "{'country': 'Czechia', 'city': None, 'state': 'Nové Měst', 'address': 'Václavské nám. 68', 'postal': '110 15', 'phone': '+420 224 497 111', 'url': 'https://www.nm.cz/en', 'coord': None}\n",
      "National Maritime Museum\n",
      "{'country': 'United Kingdom', 'city': 'SE10 9NF', 'state': 'London', 'address': 'Romney Rd', 'postal': None, 'phone': '44 20 8858 4422', 'url': 'https://www.rmg.co.uk/national-maritime-museum', 'coord': '51.481111 -0.005556'}\n"
     ]
    }
   ],
   "source": [
    "# Fetch the data and launch the GUI\n",
    "museums_by_country = fetch_museums_by_country()\n",
    "create_gui(museums_by_country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
